/* automatically generated by rust-bindgen 0.63.0 */

pub const SBG_CONFIG_UNALIGNED_ACCESS_AUTH: u32 = 0;
pub const SBG_CONFIG_BIG_ENDIAN: u32 = 0;
pub const SBG_CONFIG_ENABLE_LOG_ERROR: u32 = 1;
pub const SBG_CONFIG_ENABLE_LOG_WARNING: u32 = 1;
pub const SBG_CONFIG_ENABLE_LOG_INFO: u32 = 1;
pub const SBG_CONFIG_ENABLE_LOG_DEBUG: u32 = 1;
pub const __NEWLIB_H__: u32 = 1;
pub const _NEWLIB_VERSION_H__: u32 = 1;
pub const _NEWLIB_VERSION: &[u8; 6usize] = b"4.2.0\0";
pub const __NEWLIB__: u32 = 4;
pub const __NEWLIB_MINOR__: u32 = 2;
pub const __NEWLIB_PATCHLEVEL__: u32 = 0;
pub const _WANT_IO_C99_FORMATS: u32 = 1;
pub const _WANT_IO_LONG_LONG: u32 = 1;
pub const _WANT_REGISTER_FINI: u32 = 1;
pub const _REENT_CHECK_VERIFY: u32 = 1;
pub const _MB_LEN_MAX: u32 = 1;
pub const HAVE_INITFINI_ARRAY: u32 = 1;
pub const _ATEXIT_DYNAMIC_ALLOC: u32 = 1;
pub const _HAVE_LONG_DOUBLE: u32 = 1;
pub const _HAVE_CC_INHIBIT_LOOP_TO_LIBCALL: u32 = 1;
pub const _LDBL_EQ_DBL: u32 = 1;
pub const _FVWRITE_IN_STREAMIO: u32 = 1;
pub const _FSEEK_OPTIMIZATION: u32 = 1;
pub const _WIDE_ORIENT: u32 = 1;
pub const _UNBUF_STREAM_OPT: u32 = 1;
pub const _RETARGETABLE_LOCKING: u32 = 1;
pub const _WANT_USE_GDTOA: u32 = 1;
pub const __OBSOLETE_MATH_DEFAULT: u32 = 1;
pub const __OBSOLETE_MATH: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __ATFILE_VISIBLE: u32 = 1;

pub const SBG_ECOM_CLOCK_STATUS_SHIFT: u32 = 1;
pub const SBG_ECOM_CLOCK_STATUS_MASK: u32 = 15;
pub const SBG_ECOM_CLOCK_UTC_STATUS_SHIFT: u32 = 6;
pub const SBG_ECOM_CLOCK_UTC_STATUS_MASK: u32 = 15;
pub const SBG_ECOM_CLOCK_STABLE_INPUT: u32 = 1;
pub const SBG_ECOM_CLOCK_UTC_SYNC: u32 = 32;
pub const SBG_ECOM_DEFAULT_CMD_TIME_OUT: u32 = 500;
pub const SBG_ECOM_SENSOR_FEATURE_IMU: u32 = 1;
pub const SBG_ECOM_SENSOR_FEATURE_AHRS: u32 = 2;
pub const SBG_ECOM_SENSOR_FEATURE_NAVIGATION: u32 = 4;
pub const SBG_ECOM_SENSOR_FEATURE_SHIP_MOTION: u32 = 8;
pub const SBG_ECOM_GNSS_SIGNAL_GPS_L1: u32 = 1;
pub const SBG_ECOM_GNSS_SIGNAL_GPS_L2: u32 = 2;
pub const SBG_ECOM_GNSS_SIGNAL_GPS_L5: u32 = 4;
pub const SBG_ECOM_GNSS_SIGNAL_GLONASS_L1: u32 = 8;
pub const SBG_ECOM_GNSS_SIGNAL_GLONASS_L2: u32 = 16;
pub const SBG_ECOM_GNSS_SIGNAL_BEIDOU_B1: u32 = 32;
pub const SBG_ECOM_GNSS_SIGNAL_BEIDOU_B2: u32 = 64;
pub const SBG_ECOM_GNSS_SIGNAL_BEIDOU_B3: u32 = 128;
pub const SBG_ECOM_GNSS_SIGNAL_GALILEO_E1: u32 = 256;
pub const SBG_ECOM_GNSS_SIGNAL_GALILEO_E5: u32 = 512;
pub const SBG_ECOM_GNSS_SIGNAL_GALILEO_E6: u32 = 1024;
pub const SBG_ECOM_GNSS_SIGNAL_QZSS: u32 = 2048;
pub const SBG_ECOM_GNSS_SIGNAL_SBAS: u32 = 4096;
pub const SBG_ECOM_GNSS_SIGNAL_L_BAND: u32 = 8192;
pub const SBG_ECOM_GNSS_FEATURE_DUAL_ANT: u32 = 1;
pub const SBG_ECOM_GNSS_FEATURE_RTK_LIMITED: u32 = 2;
pub const SBG_ECOM_GNSS_FEATURE_RTK: u32 = 4;
pub const SBG_ECOM_GNSS_FEATURE_PPP: u32 = 8;
pub const SBG_ECOM_GNSS_FEATURE_RAW_DATA: u32 = 16;
pub const SBG_ECOM_GNSS_FEATURE_RAIM: u32 = 32;
pub const SBG_ECOM_GNSS_FEATURE_HIGH_SPEED: u32 = 64;
pub const SBG_ECOM_INFO_PRODUCT_CODE_LENGTH: u32 = 32;
pub const SBG_ECOM_MAG_CALIB_NOT_ENOUGH_POINTS: u32 = 1;
pub const SBG_ECOM_MAG_CALIB_TOO_MUCH_DISTORTIONS: u32 = 2;
pub const SBG_ECOM_MAG_CALIB_X_MOTION_ISSUE: u32 = 4;
pub const SBG_ECOM_MAG_CALIB_Y_MOTION_ISSUE: u32 = 8;
pub const SBG_ECOM_MAG_CALIB_Z_MOTION_ISSUE: u32 = 16;
pub const SBG_ECOM_MAG_CALIB_ALIGNMENT_ISSUE: u32 = 32;
pub const SBG_E_COM_VERSION_MAJOR: u32 = 3;
pub const SBG_E_COM_VERSION_MINOR: u32 = 2;
pub const SBG_E_COM_VERSION_REV: u32 = 4011;
extern "C" {
    pub fn __assert(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
    ) -> !;
}
extern "C" {
    pub fn __assert_func(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: *const ::core::ffi::c_char,
    ) -> !;
}
pub type error_t = ::core::ffi::c_int;
pub type wchar_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type wint_t = ::core::ffi::c_int;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __int_least8_t = ::core::ffi::c_schar;
pub type __uint_least8_t = ::core::ffi::c_uchar;
pub type __int_least16_t = ::core::ffi::c_short;
pub type __uint_least16_t = ::core::ffi::c_ushort;
pub type __int_least32_t = ::core::ffi::c_int;
pub type __uint_least32_t = ::core::ffi::c_uint;
pub type __int_least64_t = ::core::ffi::c_longlong;
pub type __uint_least64_t = ::core::ffi::c_ulonglong;
pub type __intmax_t = ::core::ffi::c_longlong;
pub type __uintmax_t = ::core::ffi::c_ulonglong;
pub type __intptr_t = ::core::ffi::c_int;
pub type __uintptr_t = ::core::ffi::c_uint;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blksize_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
pub type __dev_t = ::core::ffi::c_short;
pub type __uid_t = ::core::ffi::c_ushort;
pub type __gid_t = ::core::ffi::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = ::core::ffi::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = ::core::ffi::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = ::core::ffi::c_long;
pub type _fpos_t = ::core::ffi::c_long;
pub type __size_t = ::core::ffi::c_uint;
pub type _ssize_t = ::core::ffi::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: ::core::ffi::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [::core::ffi::c_uchar; 4usize],
}
#[test]
fn bindgen_test_layout__mbstate_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_mbstate_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout__mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<_mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(_mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
pub type _iconv_t = *mut ::core::ffi::c_void;
pub type __clock_t = ::core::ffi::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = ::core::ffi::c_ulong;
pub type __timer_t = ::core::ffi::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = ::core::ffi::c_int;
pub type __nlink_t = ::core::ffi::c_ushort;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_ulong;
pub type __va_list = u32;
pub type __ULong = ::core::ffi::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock {
    _unused: [u8; 0],
}
pub type _LOCK_T = *mut __lock;
extern "C" {
    pub fn __retarget_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_init_recursive(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_close(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_close_recursive(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_acquire(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_acquire_recursive(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_try_acquire(lock: _LOCK_T) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __retarget_lock_try_acquire_recursive(lock: _LOCK_T) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __retarget_lock_release(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_release_recursive(lock: _LOCK_T);
}
pub type _flock_t = _LOCK_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: ::core::ffi::c_int,
    pub _maxwds: ::core::ffi::c_int,
    pub _sign: ::core::ffi::c_int,
    pub _wds: ::core::ffi::c_int,
    pub _x: [__ULong; 1usize],
}
#[test]
fn bindgen_test_layout__Bigint() {
    const UNINIT: ::core::mem::MaybeUninit<_Bigint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Bigint>(),
        24usize,
        concat!("Size of: ", stringify!(_Bigint))
    );
    assert_eq!(
        ::core::mem::align_of::<_Bigint>(),
        4usize,
        concat!("Alignment of ", stringify!(_Bigint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._k) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_k)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._maxwds) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_maxwds)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._sign) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_wds)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._x) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: ::core::ffi::c_int,
    pub __tm_min: ::core::ffi::c_int,
    pub __tm_hour: ::core::ffi::c_int,
    pub __tm_mday: ::core::ffi::c_int,
    pub __tm_mon: ::core::ffi::c_int,
    pub __tm_year: ::core::ffi::c_int,
    pub __tm_wday: ::core::ffi::c_int,
    pub __tm_yday: ::core::ffi::c_int,
    pub __tm_isdst: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___tm() {
    const UNINIT: ::core::mem::MaybeUninit<__tm> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__tm>(),
        36usize,
        concat!("Size of: ", stringify!(__tm))
    );
    assert_eq!(
        ::core::mem::align_of::<__tm>(),
        4usize,
        concat!("Alignment of ", stringify!(__tm))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_min)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_year)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_isdst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut ::core::ffi::c_void; 32usize],
    pub _dso_handle: [*mut ::core::ffi::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[test]
fn bindgen_test_layout__on_exit_args() {
    const UNINIT: ::core::mem::MaybeUninit<_on_exit_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_on_exit_args>(),
        264usize,
        concat!("Size of: ", stringify!(_on_exit_args))
    );
    assert_eq!(
        ::core::mem::align_of::<_on_exit_args>(),
        4usize,
        concat!("Alignment of ", stringify!(_on_exit_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fnargs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fnargs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._dso_handle) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_dso_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fntypes) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fntypes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._is_cxa) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_is_cxa)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: ::core::ffi::c_int,
    pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[test]
fn bindgen_test_layout__atexit() {
    const UNINIT: ::core::mem::MaybeUninit<_atexit> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_atexit>(),
        400usize,
        concat!("Size of: ", stringify!(_atexit))
    );
    assert_eq!(
        ::core::mem::align_of::<_atexit>(),
        4usize,
        concat!("Alignment of ", stringify!(_atexit))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ind) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_ind)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fns) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_fns)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._on_exit_args) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_on_exit_args)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::core::mem::MaybeUninit<__sbuf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__sbuf>(),
        8usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::core::mem::align_of::<__sbuf>(),
        4usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *mut ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: _fpos_t,
            arg4: ::core::ffi::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut ::core::ffi::c_uchar,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::core::mem::MaybeUninit<__sFILE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__sFILE>(),
        104usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::core::mem::align_of::<__sFILE>(),
        4usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._up) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_up)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        67usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._data) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbstate) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_mbstate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags2)
        )
    );
}
pub type __FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: ::core::ffi::c_int,
    pub _iobs: *mut __FILE,
}
#[test]
fn bindgen_test_layout__glue() {
    const UNINIT: ::core::mem::MaybeUninit<_glue> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_glue>(),
        12usize,
        concat!("Size of: ", stringify!(_glue))
    );
    assert_eq!(
        ::core::mem::align_of::<_glue>(),
        4usize,
        concat!("Alignment of ", stringify!(_glue))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._niobs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_niobs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._iobs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_iobs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [::core::ffi::c_ushort; 3usize],
    pub _mult: [::core::ffi::c_ushort; 3usize],
    pub _add: ::core::ffi::c_ushort,
}
#[test]
fn bindgen_test_layout__rand48() {
    const UNINIT: ::core::mem::MaybeUninit<_rand48> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_rand48>(),
        14usize,
        concat!("Size of: ", stringify!(_rand48))
    );
    assert_eq!(
        ::core::mem::align_of::<_rand48>(),
        2usize,
        concat!("Alignment of ", stringify!(_rand48))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._seed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_seed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mult) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_mult)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._add) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_add)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: ::core::ffi::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: ::core::ffi::c_int,
    pub _emergency: [::core::ffi::c_char; 25usize],
    pub _unspecified_locale_info: ::core::ffi::c_int,
    pub _locale: *mut __locale_t,
    pub __sdidinit: ::core::ffi::c_int,
    pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: ::core::ffi::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: ::core::ffi::c_int,
    pub _cvtbuf: *mut ::core::ffi::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _atexit: *mut _atexit,
    pub _atexit0: _atexit,
    pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>,
    pub __sglue: _glue,
    pub __sf: [__FILE; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
    pub _unused: _reent__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _unused_rand: ::core::ffi::c_uint,
    pub _strtok_last: *mut ::core::ffi::c_char,
    pub _asctime_buf: [::core::ffi::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: ::core::ffi::c_int,
    pub _rand_next: ::core::ffi::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [::core::ffi::c_char; 8usize],
    pub _signal_buf: [::core::ffi::c_char; 24usize],
    pub _getdate_err: ::core::ffi::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        208usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused_rand) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_unused_rand)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._strtok_last) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_strtok_last)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._asctime_buf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_asctime_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._localtime_buf) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_localtime_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._gamma_signgam) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_gamma_signgam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._rand_next) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_rand_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._r48) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_r48)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mblen_state) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mblen_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbtowc_state) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbtowc_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wctomb_state) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wctomb_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._l64a_buf) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_l64a_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._signal_buf) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_signal_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._getdate_err) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_getdate_err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbrlen_state) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrlen_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbrtowc_state) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrtowc_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbsrtowcs_state) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbsrtowcs_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wcrtomb_state) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcrtomb_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wcsrtombs_state) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcsrtombs_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._h_errno) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_h_errno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_2 {
    pub _nextf: [*mut ::core::ffi::c_uchar; 30usize],
    pub _nmalloc: [::core::ffi::c_uint; 30usize],
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        240usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nextf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nextf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nmalloc) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nmalloc)
        )
    );
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1>(),
        240usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._reent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_reent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_unused)
        )
    );
}
#[test]
fn bindgen_test_layout__reent() {
    const UNINIT: ::core::mem::MaybeUninit<_reent> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent>(),
        1064usize,
        concat!("Size of: ", stringify!(_reent))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._errno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_errno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stdin) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stdout) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stderr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stderr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._inc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_inc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._emergency) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_emergency)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unspecified_locale_info) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_unspecified_locale_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._locale) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_locale)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sdidinit) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sdidinit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__cleanup) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__cleanup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._result) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._result_k) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result_k)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._p5s) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_p5s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freelist) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_freelist)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cvtlen) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cvtbuf) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._new) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_new)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._atexit) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_atexit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._atexit0) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_atexit0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._sig_func) as usize - ptr as usize },
        732usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_sig_func)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sglue) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sglue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sf) as usize - ptr as usize },
        748usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sf)
        )
    );
}
extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
extern "C" {
    pub static _global_impure_ptr: *mut _reent;
}
extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
extern "C" {
    pub fn __errno() -> *mut ::core::ffi::c_int;
}
extern "C" {
    pub static _sys_errlist: [*const ::core::ffi::c_char; 0usize];
}
extern "C" {
    pub static mut _sys_nerr: ::core::ffi::c_int;
}
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type int_fast16_t = ::core::ffi::c_short;
pub type uint_fast16_t = ::core::ffi::c_ushort;
pub type int_fast32_t = ::core::ffi::c_int;
pub type uint_fast32_t = ::core::ffi::c_uint;
pub type int_fast64_t = ::core::ffi::c_longlong;
pub type uint_fast64_t = ::core::ffi::c_ulonglong;
pub type locale_t = *mut __locale_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denomer: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _strtoimax_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _strtoumax_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _wcstoimax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _wcstoumax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn strtoimax_l(
        arg1: *const ::core::ffi::c_char,
        _restrict: *mut *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax_l(
        arg1: *const ::core::ffi::c_char,
        _restrict: *mut *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: ::core::ffi::c_int,
        arg3: locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax_l(
        arg1: *const wchar_t,
        _restrict: *mut *mut wchar_t,
        arg2: ::core::ffi::c_int,
        arg3: locale_t,
    ) -> uintmax_t;
}
extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn log(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn finite(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn finitef(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn finitel(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn isinff(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn isnanf(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn isinf(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn isnan(arg1: f64) -> ::core::ffi::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __isinff(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __isinfd(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __isnanf(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __isnand(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __fpclassifyd(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __signbitf(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __signbitd(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn infinity() -> f64;
}
extern "C" {
    pub fn nan(arg1: *const ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
extern "C" {
    pub fn ilogb(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::core::ffi::c_long) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
extern "C" {
    pub fn lrint(arg1: f64) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llrint(arg1: f64) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn round(arg1: f64) -> f64;
}
extern "C" {
    pub fn lround(arg1: f64) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llround(arg1: f64) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::core::ffi::c_long) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lrintf(arg1: f32) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llrintf(arg1: f32) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lroundf(arg1: f32) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llroundf(arg1: f32) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
extern "C" {
    pub fn infinityf() -> f32;
}
extern "C" {
    pub fn nanf(arg1: *const ::core::ffi::c_char) -> f32;
}
extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ilogbf(arg1: f32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn ceill(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabsl(arg1: f64) -> f64;
}
extern "C" {
    pub fn floorl(arg1: f64) -> f64;
}
extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
extern "C" {
    pub fn powl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
extern "C" {
    pub fn fmodl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn copysignl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nanl(arg1: *const ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn ilogbl(arg1: f64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrtl(arg1: f64) -> f64;
}
extern "C" {
    pub fn nextafterl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: f64) -> f32;
}
extern "C" {
    pub fn nexttoward(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nexttowardl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
extern "C" {
    pub fn rintl(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbnl(arg1: f64, arg2: ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalblnl(arg1: f64, arg2: ::core::ffi::c_long) -> f64;
}
extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn nearbyintl(arg1: f64) -> f64;
}
extern "C" {
    pub fn lrintl(arg1: f64) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llrintl(arg1: f64) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn roundl(arg1: f64) -> f64;
}
extern "C" {
    pub fn lroundl(arg1: f64) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn llroundl(arg1: f64) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn truncl(arg1: f64) -> f64;
}
extern "C" {
    pub fn remquol(arg1: f64, arg2: f64, arg3: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn fdiml(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmaxl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fminl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmal(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn remainderl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
extern "C" {
    pub fn drem(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn dremf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn gamma_r(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, arg2: *mut ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn gammaf_r(arg1: f32, arg2: *mut ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, arg2: *mut ::core::ffi::c_int) -> f32;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::core::ffi::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::core::ffi::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::core::ffi::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::core::ffi::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __signgam() -> *mut ::core::ffi::c_int;
}
pub type va_list = u32;
pub type __gnuc_va_list = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::core::ffi::c_int,
    pub rem: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::core::mem::MaybeUninit<div_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::core::ffi::c_long,
    pub rem: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<ldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::core::ffi::c_longlong,
    pub rem: ::core::ffi::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<lldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
extern "C" {
    pub fn __locale_mb_cur_max() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn abs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_uniform(arg1: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(arg1: *mut ::core::ffi::c_void, arg2: usize);
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn atof(__nptr: *const ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn atoff(__nptr: *const ::core::ffi::c_char) -> f32;
}
extern "C" {
    pub fn atoi(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _atoi_r(arg1: *mut _reent, __nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _atol_r(arg1: *mut _reent, __nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn bsearch(
        __key: *const ::core::ffi::c_void,
        __base: *const ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn calloc(arg1: ::core::ffi::c_uint, arg2: ::core::ffi::c_uint)
        -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn div(__numer: ::core::ffi::c_int, __denom: ::core::ffi::c_int) -> div_t;
}
extern "C" {
    pub fn exit(__status: ::core::ffi::c_int) -> !;
}
extern "C" {
    pub fn free(arg1: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn getenv(__string: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _getenv_r(
        arg1: *mut _reent,
        __string: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _findenv(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _findenv_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub static mut suboptarg: *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const *mut ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn labs(arg1: ::core::ffi::c_long) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn ldiv(__numer: ::core::ffi::c_long, __denom: ::core::ffi::c_long) -> ldiv_t;
}
extern "C" {
    pub fn malloc(arg1: ::core::ffi::c_uint) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn mblen(arg1: *const ::core::ffi::c_char, arg2: usize) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mblen_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: *mut _mbstate_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mbtowc_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const ::core::ffi::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn wctomb(arg1: *mut ::core::ffi::c_char, arg2: wchar_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _wctomb_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: wchar_t,
        arg4: *mut _mbstate_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::core::ffi::c_char, arg3: usize) -> usize;
}
extern "C" {
    pub fn _mbstowcs_r(
        arg1: *mut _reent,
        arg2: *mut wchar_t,
        arg3: *const ::core::ffi::c_char,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcstombs(arg1: *mut ::core::ffi::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
extern "C" {
    pub fn _wcstombs_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const wchar_t,
        arg4: usize,
        arg5: *mut _mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mkdtemp(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn mkstemp(arg1: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mkstemps(arg1: *mut ::core::ffi::c_char, arg2: ::core::ffi::c_int)
        -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mktemp(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _mkdtemp_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _mkostemp_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mkostemps_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mkstemp_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mkstemps_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _mktemp_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char)
        -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
        _compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn rand() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn realloc(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn reallocarray(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn reallocf(arg1: *mut ::core::ffi::c_void, arg2: usize) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn realpath(
        path: *const ::core::ffi::c_char,
        resolved_path: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn rpmatch(response: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn srand(__seed: ::core::ffi::c_uint);
}
extern "C" {
    pub fn strtod(__n: *const ::core::ffi::c_char, __end_PTR: *mut *mut ::core::ffi::c_char)
        -> f64;
}
extern "C" {
    pub fn _strtod_r(
        arg1: *mut _reent,
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(__n: *const ::core::ffi::c_char, __end_PTR: *mut *mut ::core::ffi::c_char)
        -> f32;
}
extern "C" {
    pub fn strtol(
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _strtol_r(
        arg1: *mut _reent,
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn strtoul(
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulong;
}
extern "C" {
    pub fn _strtoul_r(
        arg1: *mut _reent,
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulong;
}
extern "C" {
    pub fn system(__string: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn a64l(__input: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn l64a(__input: ::core::ffi::c_long) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _l64a_r(arg1: *mut _reent, __input: ::core::ffi::c_long) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(arg1: ::core::ffi::c_int, arg2: *mut ::core::ffi::c_void),
        >,
        __arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _Exit(__status: ::core::ffi::c_int) -> !;
}
extern "C" {
    pub fn putenv(__string: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putenv_r(arg1: *mut _reent, __string: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _reallocf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn setenv(
        __string: *const ::core::ffi::c_char,
        __value: *const ::core::ffi::c_char,
        __overwrite: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _setenv_r(
        arg1: *mut _reent,
        __string: *const ::core::ffi::c_char,
        __value: *const ::core::ffi::c_char,
        __overwrite: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __itoa(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __utoa(
        arg1: ::core::ffi::c_uint,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn itoa(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn utoa(
        arg1: ::core::ffi::c_uint,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn rand_r(__seed: *mut ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn _drand48_r(arg1: *mut _reent) -> f64;
}
extern "C" {
    pub fn erand48(arg1: *mut ::core::ffi::c_ushort) -> f64;
}
extern "C" {
    pub fn _erand48_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_ushort) -> f64;
}
extern "C" {
    pub fn jrand48(arg1: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _jrand48_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn lcong48(arg1: *mut ::core::ffi::c_ushort);
}
extern "C" {
    pub fn _lcong48_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_ushort);
}
extern "C" {
    pub fn lrand48() -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _lrand48_r(arg1: *mut _reent) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn mrand48() -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _mrand48_r(arg1: *mut _reent) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn nrand48(arg1: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _nrand48_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn seed48(arg1: *mut ::core::ffi::c_ushort) -> *mut ::core::ffi::c_ushort;
}
extern "C" {
    pub fn _seed48_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_ushort,
    ) -> *mut ::core::ffi::c_ushort;
}
extern "C" {
    pub fn srand48(arg1: ::core::ffi::c_long);
}
extern "C" {
    pub fn _srand48_r(arg1: *mut _reent, arg2: ::core::ffi::c_long);
}
extern "C" {
    pub fn initstate(
        arg1: ::core::ffi::c_uint,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn random() -> ::core::ffi::c_long;
}
extern "C" {
    pub fn setstate(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn srandom(arg1: ::core::ffi::c_uint);
}
extern "C" {
    pub fn atoll(__nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn _atoll_r(
        arg1: *mut _reent,
        __nptr: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn llabs(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn lldiv(__numer: ::core::ffi::c_longlong, __denom: ::core::ffi::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn strtoll(
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn _strtoll_r(
        arg1: *mut _reent,
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
extern "C" {
    pub fn _strtoull_r(
        arg1: *mut _reent,
        __n: *const ::core::ffi::c_char,
        __end_PTR: *mut *mut ::core::ffi::c_char,
        __base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
extern "C" {
    pub fn cfree(arg1: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn unsetenv(__string: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _unsetenv_r(
        arg1: *mut _reent,
        __string: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _dtoa_r(
        arg1: *mut _reent,
        arg2: f64,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_int,
        arg5: *mut ::core::ffi::c_int,
        arg6: *mut ::core::ffi::c_int,
        arg7: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _malloc_r(arg1: *mut _reent, arg2: usize) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn _calloc_r(arg1: *mut _reent, arg2: usize, arg3: usize) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn _free_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn _realloc_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn _mstats_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn _system_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __eprintf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
        arg4: *const ::core::ffi::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}__bsd_qsort_r"]
    pub fn qsort_r(
        __base: *mut ::core::ffi::c_void,
        __nmemb: usize,
        __size: usize,
        __thunk: *mut ::core::ffi::c_void,
        _compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
                arg3: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    );
}
extern "C" {
    pub fn _strtold_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtold(arg1: *const ::core::ffi::c_char, arg2: *mut *mut ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn aligned_alloc(
        arg1: ::core::ffi::c_uint,
        arg2: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn at_quick_exit(
        arg1: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn quick_exit(arg1: ::core::ffi::c_int);
}
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = __intptr_t;
pub type __sigset_t = ::core::ffi::c_ulong;
pub type suseconds_t = __suseconds_t;
pub type time_t = __int_least64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::core::mem::MaybeUninit<timeval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<timespec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::core::mem::MaybeUninit<itimerspec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::core::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
pub type sigset_t = __sigset_t;
pub type __fd_mask = ::core::ffi::c_ulong;
pub type fd_mask = __fd_mask;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 2usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::core::mem::MaybeUninit<fd_set> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        8usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
extern "C" {
    pub fn select(
        __n: ::core::ffi::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn pselect(
        __n: ::core::ffi::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __set: *const sigset_t,
    ) -> ::core::ffi::c_int;
}
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type u_register_t = __uintptr_t;
pub type u_char = ::core::ffi::c_uchar;
pub type u_short = ::core::ffi::c_ushort;
pub type u_int = ::core::ffi::c_uint;
pub type u_long = ::core::ffi::c_ulong;
pub type ushort = ::core::ffi::c_ushort;
pub type uint = ::core::ffi::c_uint;
pub type ulong = ::core::ffi::c_ulong;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type clock_t = ::core::ffi::c_ulong;
pub type daddr_t = ::core::ffi::c_long;
pub type caddr_t = *mut ::core::ffi::c_char;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type off_t = __off_t;
pub type dev_t = __dev_t;
pub type uid_t = __uid_t;
pub type gid_t = __gid_t;
pub type pid_t = __pid_t;
pub type key_t = __key_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type sbintime_t = __int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    const UNINIT: ::core::mem::MaybeUninit<sched_param> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::core::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sched_priority) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type pthread_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub stackaddr: *mut ::core::ffi::c_void,
    pub stacksize: ::core::ffi::c_int,
    pub contentionscope: ::core::ffi::c_int,
    pub inheritsched: ::core::ffi::c_int,
    pub schedpolicy: ::core::ffi::c_int,
    pub schedparam: sched_param,
    pub detachstate: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_attr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stackaddr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stackaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stacksize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stacksize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).contentionscope) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(contentionscope)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).inheritsched) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(inheritsched)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).schedpolicy) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedpolicy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).schedparam) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedparam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).detachstate) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(detachstate)
        )
    );
}
pub type pthread_mutex_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub recursive: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_mutexattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).recursive) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(recursive)
        )
    );
}
pub type pthread_cond_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub clock: clock_t,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_condattr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(clock)
        )
    );
}
pub type pthread_key_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_once_t {
    pub is_initialized: ::core::ffi::c_int,
    pub init_executed: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_once_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_once_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_once_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_once_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_once_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_once_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_executed) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(init_executed)
        )
    );
}
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
extern "C" {
    pub fn ctermid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tempnam(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn scanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::core::ffi::c_char, arg2: u32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn fputc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::core::ffi::c_char, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn putc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ungetc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fread(
        arg1: *mut ::core::ffi::c_void,
        _size: ::core::ffi::c_uint,
        _n: ::core::ffi::c_uint,
        arg2: *mut FILE,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn fwrite(
        arg1: *const ::core::ffi::c_void,
        _size: ::core::ffi::c_uint,
        _n: ::core::ffi::c_uint,
        arg2: *mut FILE,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::core::ffi::c_long,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn perror(arg1: *const ::core::ffi::c_char);
}
extern "C" {
    pub fn fopen(_name: *const ::core::ffi::c_char, _type: *const ::core::ffi::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn rename(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
        arg3: *const ::core::ffi::c_char,
        arg4: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vscanf(arg1: *const ::core::ffi::c_char, arg2: u32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn asiprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn asniprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn asnprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn diprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fiprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fiscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn iprintf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn iscanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn siprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn siscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sniprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vasiprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vasniprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn vasnprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn vdiprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfiprintf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfiscanf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn viprintf(arg1: *const ::core::ffi::c_char, arg2: __gnuc_va_list) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn viscanf(arg1: *const ::core::ffi::c_char, arg2: __gnuc_va_list) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsiprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsiscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsniprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fdopen(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn popen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char, arg3: ::core::ffi::c_int);
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putw(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn putc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn dprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fmemopen(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::core::ffi::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn renameat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _asiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _asniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _asnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _asprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _diprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _dprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fclose_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fcloseall_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fdopen_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fflush_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgetc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgetc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgets_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _fgets_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _fgetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *mut fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fsetpos_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const fpos_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fmemopen_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fopen_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _freopen_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fpurge_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputs_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputs_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fread_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fseek_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: ::core::ffi::c_long,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fseeko_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: _off_t,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _ftell_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _ftello_r(arg1: *mut _reent, arg2: *mut FILE) -> _off_t;
}
extern "C" {
    pub fn _rewind_r(arg1: *mut _reent, arg2: *mut FILE);
}
extern "C" {
    pub fn _fwrite_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fwrite_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getchar_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getchar_unlocked_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _gets_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _iprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _iscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _open_memstream_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _perror_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char);
}
extern "C" {
    pub fn _printf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putchar_unlocked_r(arg1: *mut _reent, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putchar_r(arg1: *mut _reent, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _puts_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _remove_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _rename_r(
        arg1: *mut _reent,
        _old: *const ::core::ffi::c_char,
        _new: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _scanf_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char, ...)
        -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _siprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _siscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _snprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _tempnam_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _tmpfile_r(arg1: *mut _reent) -> *mut FILE;
}
extern "C" {
    pub fn _tmpnam_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char)
        -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _ungetc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vasiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vasniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _vasnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _vasprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vdiprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vdprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _viprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _viscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsiprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsiscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __getdelim(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn __getline(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fputc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        arg1: *mut ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        arg1: *const ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg2: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn __srget_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __swbuf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn funopen(
        __cookie: *const ::core::ffi::c_void,
        __readfn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __buf: *mut ::core::ffi::c_char,
                __n: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        __writefn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __buf: *const ::core::ffi::c_char,
                __n: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        __seekfn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __off: fpos_t,
                __whence: ::core::ffi::c_int,
            ) -> fpos_t,
        >,
        __closefn: ::core::option::Option<
            unsafe extern "C" fn(__cookie: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _funopen_r(
        arg1: *mut _reent,
        __cookie: *const ::core::ffi::c_void,
        __readfn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __buf: *mut ::core::ffi::c_char,
                __n: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        __writefn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __buf: *const ::core::ffi::c_char,
                __n: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        __seekfn: ::core::option::Option<
            unsafe extern "C" fn(
                __cookie: *mut ::core::ffi::c_void,
                __off: fpos_t,
                __whence: ::core::ffi::c_int,
            ) -> fpos_t,
        >,
        __closefn: ::core::option::Option<
            unsafe extern "C" fn(__cookie: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn bcopy(arg1: *const ::core::ffi::c_void, arg2: *mut ::core::ffi::c_void, arg3: usize);
}
extern "C" {
    pub fn bzero(arg1: *mut ::core::ffi::c_void, arg2: ::core::ffi::c_uint);
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::core::ffi::c_void, arg2: usize);
}
extern "C" {
    pub fn ffs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ffsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ffsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fls(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn flsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn flsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn index(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn rindex(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strcasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strncasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn memchr(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn memcpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memmove(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memset(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn strcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strcmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strcoll(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strcspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strerror(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strlen(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strncat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strncmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strrchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strtok(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strxfrm(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strcoll_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strerror_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strtok_r(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn memccpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn stpcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn stpncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strdup(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _strdup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strndup(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _strndup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
        arg4: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strlcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strnlen(arg1: *const ::core::ffi::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strnstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strlwr(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strupr(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strsignal(__signo: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::core::ffi::c_int,
    pub tm_min: ::core::ffi::c_int,
    pub tm_hour: ::core::ffi::c_int,
    pub tm_mday: ::core::ffi::c_int,
    pub tm_mon: ::core::ffi::c_int,
    pub tm_year: ::core::ffi::c_int,
    pub tm_wday: ::core::ffi::c_int,
    pub tm_yday: ::core::ffi::c_int,
    pub tm_isdst: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::core::mem::MaybeUninit<tm> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<tm>(),
        36usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::core::mem::align_of::<tm>(),
        4usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn difftime(_time2: time_t, _time1: time_t) -> f64;
}
extern "C" {
    pub fn mktime(_timeptr: *mut tm) -> time_t;
}
extern "C" {
    pub fn time(_timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn asctime(_tblock: *const tm) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn ctime(_time: *const time_t) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn gmtime(_timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(_timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn strftime(
        _s: *mut ::core::ffi::c_char,
        _maxsize: usize,
        _fmt: *const ::core::ffi::c_char,
        _t: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        _s: *mut ::core::ffi::c_char,
        _maxsize: usize,
        _fmt: *const ::core::ffi::c_char,
        _t: *const tm,
        _l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn asctime_r(arg1: *const tm, arg2: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn ctime_r(arg1: *const time_t, arg2: *mut ::core::ffi::c_char)
        -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub fn _tzset_r(arg1: *mut _reent);
}
extern "C" {
    pub static mut _timezone: ::core::ffi::c_long;
}
extern "C" {
    pub static mut _daylight: ::core::ffi::c_int;
}
extern "C" {
    pub static mut _tzname: [*mut ::core::ffi::c_char; 2usize];
}
#[doc = "< The operation was successfully executed."]
pub const _SbgErrorCode_SBG_NO_ERROR: _SbgErrorCode = 0;
#[doc = "< We have a generic error."]
pub const _SbgErrorCode_SBG_ERROR: _SbgErrorCode = 1;
#[doc = "< A pointer is null."]
pub const _SbgErrorCode_SBG_NULL_POINTER: _SbgErrorCode = 2;
#[doc = "< The received frame has an invalid CRC."]
pub const _SbgErrorCode_SBG_INVALID_CRC: _SbgErrorCode = 3;
#[doc = "< The received frame is invalid <br> */\n/*!<\tWe have received an unexpected frame (not the cmd we are waiting for or with an invalid data size.<br> */\n/*!<\tThis could be caused by a desync between questions and answers.<br> */\n/*!<\tYou should flush the serial port to fix this."]
pub const _SbgErrorCode_SBG_INVALID_FRAME: _SbgErrorCode = 4;
#[doc = "< We have started to receive a frame but not the end."]
pub const _SbgErrorCode_SBG_TIME_OUT: _SbgErrorCode = 5;
#[doc = "< All bytes hasn't been written."]
pub const _SbgErrorCode_SBG_WRITE_ERROR: _SbgErrorCode = 6;
#[doc = "< All bytes hasn't been read."]
pub const _SbgErrorCode_SBG_READ_ERROR: _SbgErrorCode = 7;
#[doc = "< A buffer is too small to contain so much data."]
pub const _SbgErrorCode_SBG_BUFFER_OVERFLOW: _SbgErrorCode = 8;
#[doc = "< An invalid parameter has been found."]
pub const _SbgErrorCode_SBG_INVALID_PARAMETER: _SbgErrorCode = 9;
#[doc = "< A device isn't ready (Rx isn't ready for example)."]
pub const _SbgErrorCode_SBG_NOT_READY: _SbgErrorCode = 10;
#[doc = "< Failed to allocate a buffer."]
pub const _SbgErrorCode_SBG_MALLOC_FAILED: _SbgErrorCode = 11;
#[doc = "< Not enough points were available to perform magnetometers calibration."]
pub const _SbgErrorCode_SGB_CALIB_MAG_NOT_ENOUGH_POINTS: _SbgErrorCode = 12;
#[doc = "< The calibration procedure could not be properly executed due to insufficient precision."]
pub const _SbgErrorCode_SBG_CALIB_MAG_INVALID_TAKE: _SbgErrorCode = 13;
#[doc = "< Saturation were detected when attempt to calibrate magnetos."]
pub const _SbgErrorCode_SBG_CALIB_MAG_SATURATION: _SbgErrorCode = 14;
#[doc = "< 2D calibration procedure could not be performed."]
pub const _SbgErrorCode_SBG_CALIB_MAG_POINTS_NOT_IN_A_PLANE: _SbgErrorCode = 15;
#[doc = "< A device couldn't be founded or opened PC only error code"]
pub const _SbgErrorCode_SBG_DEVICE_NOT_FOUND: _SbgErrorCode = 16;
#[doc = "< An operation was canceled.  PC only error code"]
pub const _SbgErrorCode_SBG_OPERATION_CANCELLED: _SbgErrorCode = 17;
#[doc = "< We have received a frame that isn't a continuous one. PC only error code"]
pub const _SbgErrorCode_SBG_NOT_CONTINUOUS_FRAME: _SbgErrorCode = 18;
#[doc = "< Hence valid; the command cannot be executed because of hardware incompatibility"]
pub const _SbgErrorCode_SBG_INCOMPATIBLE_HARDWARE: _SbgErrorCode = 19;
#[doc = "< Incompatible version"]
pub const _SbgErrorCode_SBG_INVALID_VERSION: _SbgErrorCode = 20;
#[doc = "\tGeneric errors definitions for SBG Systems projects."]
pub type _SbgErrorCode = ::core::ffi::c_uint;
#[doc = "\tGeneric errors definitions for SBG Systems projects."]
pub use self::_SbgErrorCode as SbgErrorCode;
pub type uint8 = ::core::ffi::c_uchar;
pub type uint16 = ::core::ffi::c_ushort;
pub type uint32 = ::core::ffi::c_uint;
pub type uint64 = ::core::ffi::c_ulonglong;
pub type int8 = ::core::ffi::c_schar;
pub type int16 = ::core::ffi::c_short;
pub type int32 = ::core::ffi::c_int;
pub type int64 = ::core::ffi::c_longlong;
pub type sbgIpAddress = u32;
#[doc = " Used to get a uint32_t from a uint8_t array."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8PtrToUint32Ptr {
    #[doc = "< Set the address used to access the uint32_t."]
    pub m_pointerUint8: *mut u8,
    #[doc = "< Store the unint32 value."]
    pub m_pointerUint32: *mut u32,
}
#[test]
fn bindgen_test_layout__Uint8PtrToUint32Ptr() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8PtrToUint32Ptr> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8PtrToUint32Ptr>(),
        4usize,
        concat!("Size of: ", stringify!(_Uint8PtrToUint32Ptr))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8PtrToUint32Ptr>(),
        4usize,
        concat!("Alignment of ", stringify!(_Uint8PtrToUint32Ptr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_pointerUint8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8PtrToUint32Ptr),
            "::",
            stringify!(m_pointerUint8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_pointerUint32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8PtrToUint32Ptr),
            "::",
            stringify!(m_pointerUint32)
        )
    );
}
#[doc = " Used to get a uint32_t from a uint8_t array."]
pub type Uint8PtrToUint32Ptr = _Uint8PtrToUint32Ptr;
#[doc = " Union used to convert a buffer or 2 unit8 two's complement values to a int16_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToInt16 {
    pub value: i16,
    pub buffer: [u8; 2usize],
}
#[test]
fn bindgen_test_layout__Uint8ToInt16() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToInt16> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToInt16>(),
        2usize,
        concat!("Size of: ", stringify!(_Uint8ToInt16))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToInt16>(),
        2usize,
        concat!("Alignment of ", stringify!(_Uint8ToInt16))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt16),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt16),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 2 unit8 two's complement values to a int16_t"]
pub type Uint8ToInt16 = _Uint8ToInt16;
#[doc = " Union used to convert a buffer or 2 unit8 values to a uint16_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToUint16 {
    pub value: u16,
    pub buffer: [u8; 2usize],
}
#[test]
fn bindgen_test_layout__Uint8ToUint16() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToUint16> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToUint16>(),
        2usize,
        concat!("Size of: ", stringify!(_Uint8ToUint16))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToUint16>(),
        2usize,
        concat!("Alignment of ", stringify!(_Uint8ToUint16))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint16),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint16),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 2 unit8 values to a uint16_t"]
pub type Uint8ToUint16 = _Uint8ToUint16;
#[doc = " Union used to convert a buffer or 4 unit8 two's complement values to a int32_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToInt32 {
    pub value: i32,
    pub buffer: [u8; 4usize],
}
#[test]
fn bindgen_test_layout__Uint8ToInt32() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToInt32> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToInt32>(),
        4usize,
        concat!("Size of: ", stringify!(_Uint8ToInt32))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToInt32>(),
        4usize,
        concat!("Alignment of ", stringify!(_Uint8ToInt32))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt32),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt32),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 4 unit8 two's complement values to a int32_t"]
pub type Uint8ToInt32 = _Uint8ToInt32;
#[doc = " Union used to convert a buffer or 4 unit8 values to a uint32_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToUint32 {
    pub value: u32,
    pub buffer: [u8; 4usize],
}
#[test]
fn bindgen_test_layout__Uint8ToUint32() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToUint32> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToUint32>(),
        4usize,
        concat!("Size of: ", stringify!(_Uint8ToUint32))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToUint32>(),
        4usize,
        concat!("Alignment of ", stringify!(_Uint8ToUint32))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint32),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint32),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 4 unit8 values to a uint32_t"]
pub type Uint8ToUint32 = _Uint8ToUint32;
#[doc = " Union used to convert a buffer or 8 unit8 two's complement values to a int64_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToInt64 {
    pub value: i64,
    pub buffer: [u8; 8usize],
}
#[test]
fn bindgen_test_layout__Uint8ToInt64() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToInt64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToInt64>(),
        8usize,
        concat!("Size of: ", stringify!(_Uint8ToInt64))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToInt64>(),
        8usize,
        concat!("Alignment of ", stringify!(_Uint8ToInt64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt64),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToInt64),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 8 unit8 two's complement values to a int64_t"]
pub type Uint8ToInt64 = _Uint8ToInt64;
#[doc = " Union used to convert a buffer or 8 unit8 values to a uint64_t"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _Uint8ToUint64 {
    pub value: u64,
    pub buffer: [u8; 8usize],
}
#[test]
fn bindgen_test_layout__Uint8ToUint64() {
    const UNINIT: ::core::mem::MaybeUninit<_Uint8ToUint64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Uint8ToUint64>(),
        8usize,
        concat!("Size of: ", stringify!(_Uint8ToUint64))
    );
    assert_eq!(
        ::core::mem::align_of::<_Uint8ToUint64>(),
        8usize,
        concat!("Alignment of ", stringify!(_Uint8ToUint64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint64),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Uint8ToUint64),
            "::",
            stringify!(buffer)
        )
    );
}
#[doc = " Union used to convert a buffer or 8 unit8 values to a uint64_t"]
pub type Uint8ToUint64 = _Uint8ToUint64;
#[doc = " Union that allows type punning (access to a floating point number bits)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _FloatNint {
    pub valF: f32,
    pub valI: i32,
    pub valU: u32,
}
#[test]
fn bindgen_test_layout__FloatNint() {
    const UNINIT: ::core::mem::MaybeUninit<_FloatNint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_FloatNint>(),
        4usize,
        concat!("Size of: ", stringify!(_FloatNint))
    );
    assert_eq!(
        ::core::mem::align_of::<_FloatNint>(),
        4usize,
        concat!("Alignment of ", stringify!(_FloatNint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valF) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FloatNint),
            "::",
            stringify!(valF)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valI) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FloatNint),
            "::",
            stringify!(valI)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valU) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FloatNint),
            "::",
            stringify!(valU)
        )
    );
}
#[doc = " Union that allows type punning (access to a floating point number bits)"]
pub type FloatNint = _FloatNint;
#[doc = " Union that allows type punning (access to a double number bits)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DoubleNint {
    pub valF: f64,
    pub valU: u64,
    pub valI: i64,
}
#[test]
fn bindgen_test_layout__DoubleNint() {
    const UNINIT: ::core::mem::MaybeUninit<_DoubleNint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DoubleNint>(),
        8usize,
        concat!("Size of: ", stringify!(_DoubleNint))
    );
    assert_eq!(
        ::core::mem::align_of::<_DoubleNint>(),
        8usize,
        concat!("Alignment of ", stringify!(_DoubleNint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valF) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DoubleNint),
            "::",
            stringify!(valF)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valU) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DoubleNint),
            "::",
            stringify!(valU)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).valI) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DoubleNint),
            "::",
            stringify!(valI)
        )
    );
}
#[doc = " Union that allows type punning (access to a double number bits)"]
pub type DoubleNint = _DoubleNint;
#[doc = " Structure that splits a 64bits"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Split64 {
    pub high: u32,
    pub low: u32,
}
#[test]
fn bindgen_test_layout__Split64() {
    const UNINIT: ::core::mem::MaybeUninit<_Split64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Split64>(),
        8usize,
        concat!("Size of: ", stringify!(_Split64))
    );
    assert_eq!(
        ::core::mem::align_of::<_Split64>(),
        4usize,
        concat!("Alignment of ", stringify!(_Split64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).high) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Split64),
            "::",
            stringify!(high)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).low) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Split64),
            "::",
            stringify!(low)
        )
    );
}
#[doc = " Structure that splits a 64bits"]
pub type Split64 = _Split64;
#[doc = " Set of 3 int32_t"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgVector3i {
    pub v: [i32; 3usize],
}
#[test]
fn bindgen_test_layout__SbgVector3i() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgVector3i> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgVector3i>(),
        12usize,
        concat!("Size of: ", stringify!(_SbgVector3i))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgVector3i>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgVector3i))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgVector3i),
            "::",
            stringify!(v)
        )
    );
}
#[doc = " Set of 3 int32_t"]
pub type SbgVector3i = _SbgVector3i;
#[doc = " Set of 3 int64_t"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgVector3ll {
    pub v: [i64; 3usize],
}
#[test]
fn bindgen_test_layout__SbgVector3ll() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgVector3ll> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgVector3ll>(),
        24usize,
        concat!("Size of: ", stringify!(_SbgVector3ll))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgVector3ll>(),
        8usize,
        concat!("Alignment of ", stringify!(_SbgVector3ll))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgVector3ll),
            "::",
            stringify!(v)
        )
    );
}
#[doc = " Set of 3 int64_t"]
pub type SbgVector3ll = _SbgVector3ll;
#[doc = "< The message to log is an error."]
pub const _SbgDebugLogType_SBG_DEBUG_LOG_TYPE_ERROR: _SbgDebugLogType = 0;
#[doc = "< The message to log is a warning."]
pub const _SbgDebugLogType_SBG_DEBUG_LOG_TYPE_WARNING: _SbgDebugLogType = 1;
#[doc = "< The message to log is an information."]
pub const _SbgDebugLogType_SBG_DEBUG_LOG_TYPE_INFO: _SbgDebugLogType = 2;
#[doc = "< The message to log is a debug information."]
pub const _SbgDebugLogType_SBG_DEBUG_LOG_TYPE_DEBUG: _SbgDebugLogType = 3;
#[doc = "\tEnum that identify the type of error / warning that has been thrown."]
pub type _SbgDebugLogType = ::core::ffi::c_uint;
#[doc = "\tEnum that identify the type of error / warning that has been thrown."]
pub use self::_SbgDebugLogType as SbgDebugLogType;
extern "C" {
    #[doc = " Produce a text dump of a buffer.\n\n \\param[in]\tpPrefix\t\t\t\t\t\tPrefix string before each line.\n \\param[in]\tpBuffer\t\t\t\t\t\tData buffer, may be NULL.\n \\param[in]\tsize\t\t\t\t\t\tData size, in bytes."]
    pub fn sbgDebugHexDump(
        pPrefix: *const ::core::ffi::c_char,
        pBuffer: *const ::core::ffi::c_void,
        size: usize,
    );
}
#[doc = " Type for logging functions.\n\n \\param[in]\tpFileName\t\t\t\t\tFile name where the error occurred.\n \\param[in]\tpFunctionName\t\t\t\tFunction name where the error occurred.\n \\param[in]\tline\t\t\t\t\t\tLine number where the error occurred.\n \\param[in]\tpCategory\t\t\t\t\tCategory for this log or \"None\" if no category has been specified.\n \\param[in]\tlogType\t\t\t\t\t\tDefine if we have an error, a warning, an info or a debug log.\n \\param[in]\terrorCode\t\t\t\t\tThe error code associated with the message.\n \\param[in]\tpMessage\t\t\t\t\tThe message to log."]
pub type SbgCommonLibOnLogFunc = ::core::option::Option<
    unsafe extern "C" fn(
        pFileName: *const ::core::ffi::c_char,
        pFunctionName: *const ::core::ffi::c_char,
        line: u32,
        pCategory: *const ::core::ffi::c_char,
        logType: SbgDebugLogType,
        errorCode: SbgErrorCode,
        pMessage: *const ::core::ffi::c_char,
    ),
>;
extern "C" {
    #[doc = " Get the current time.\n\n \\return\t\t\t\t\t\t\t\t\tThe current time, in ms."]
    pub fn sbgGetTime() -> u32;
}
extern "C" {
    #[doc = " Sleep.\n\n \\param[in]\tms\t\t\t\t\t\t\tTime to wait, in ms."]
    pub fn sbgSleep(ms: u32);
}
extern "C" {
    #[doc = " Set the log function.\n\n Some platforms may not provide the ability to set a user-provided log function, in which\n case this function does nothing.\n\n \\param[in]\tlogCallback\t\t\t\t\tLog function."]
    pub fn sbgCommonLibSetLogCallback(logCallback: SbgCommonLibOnLogFunc);
}
extern "C" {
    #[doc = " Log a message.\n\n \\param[in]\tpFileName\t\t\t\t\tFile name where the error occurred.\n \\param[in]\tpFunctionName\t\t\t\tFunction name where the error occurred.\n \\param[in]\tline\t\t\t\t\t\tLine number where the error occurred.\n \\param[in]\tpCategory\t\t\t\t\tCategory for this log or \"None\" if no category has been specified.\n \\param[in]\tlogType\t\t\t\t\t\tDefine if we have an error, a warning, an info or a debug log.\n \\param[in]\terrorCode\t\t\t\t\tThe error code associated with the message.\n \\param[in]\tpFormat\t\t\t\t\t\tThe error message that will be used with the variable list of arguments."]
    pub fn sbgPlatformDebugLogMsg(
        pFileName: *const ::core::ffi::c_char,
        pFunctionName: *const ::core::ffi::c_char,
        line: u32,
        pCategory: *const ::core::ffi::c_char,
        logType: SbgDebugLogType,
        errorCode: SbgErrorCode,
        pFormat: *const ::core::ffi::c_char,
        ...
    );
}
extern "C" {
    #[doc = " Retreive the current sbgCommonLib encoded version.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tThe current sbgCommonLib version"]
    pub fn sbgCommonLibGetVersion() -> u32;
}
extern "C" {
    #[doc = "\tTell if the library is compiled in debug mode or not\n\t\\return\t\t\t\t\t\tTrue if it's compiled in debug, False otherwise"]
    pub fn sbgCommonLibIsDebug() -> bool;
}
pub type SbgCrc32 = u32;
pub type SbgCrc16 = u16;
extern "C" {
    #[doc = "\tInitialize the 32 bit CRC computation system.\n\t\\param[in]\tpInstance\t\t\t\tPointer on an allocated but non initialized Crc32 object."]
    pub fn sbgCrc32Initialize(pInstance: *mut SbgCrc32);
}
extern "C" {
    #[doc = "\tCompute a 32 bit CRC using an Ethernet polynome.\n\tWarning: the buffer size should be at least 4 bytes long.\n\t\\param[in]\tpInstance\t\t\t\tRead only pointer on a valid Crc32 object.\n\t\\param[in]\tpData\t\t\t\t\tRead only pointer on the data buffer to compute CRC on.\n\t\\param[in]\tdataSize\t\t\t\tData size in bytes of the buffer, has to be greater or equals to 4."]
    pub fn sbgCrc32Update(
        pInstance: *mut SbgCrc32,
        pData: *const ::core::ffi::c_void,
        dataSize: usize,
    );
}
extern "C" {
    #[doc = "\tCompute a 32 Bit CRC using an Ethernet polynome.\n\tWarning: the buffer size should be at least 4 bytes long.\n\t\\param[in]\tpData\t\t\t\t\tRead only pointer on the data buffer to compute CRC on.\n\t\\param[in]\tdataSize\t\t\t\tData size in bytes of the buffer, has to be greater or equals to 4.\n\t\\return\t\t\t\t\t\t\t\tThe computed CRC."]
    pub fn sbgCrc32Compute(pData: *const ::core::ffi::c_void, dataSize: usize) -> u32;
}
extern "C" {
    #[doc = "\tInitialize the 16 bit CRC computation system.\n\t\\param[in]\tpInstance\t\t\t\tPointer on an allocated but non initialized Crc16 object."]
    pub fn sbgCrc16Initialize(pInstance: *mut SbgCrc16);
}
extern "C" {
    #[doc = "\tCompute a 16 bit CRC using an the polynome 0x8408.\n\t\\param[in]\tpInstance\t\t\t\tRead only pointer on a valid Crc16 object.\n\t\\param[in]\tpData\t\t\t\t\tRead only pointer on the data buffer to compute CRC on.\n\t\\param[in]\tdataSize\t\t\t\tData size in bytes of the buffer."]
    pub fn sbgCrc16Update(
        pInstance: *mut SbgCrc16,
        pData: *const ::core::ffi::c_void,
        dataSize: usize,
    );
}
extern "C" {
    #[doc = "\tCompute a 32 Bit CRC using an the polynome 0x8408.\n\t\\param[in]\tpData\t\t\t\t\tRead only pointer on the data buffer to compute CRC on.\n\t\\param[in]\tdataSize\t\t\t\tData size in bytes of the buffer.\n\t\\return\t\t\t\t\t\t\t\tThe computed CRC."]
    pub fn sbgCrc16Compute(pData: *const ::core::ffi::c_void, dataSize: usize) -> u16;
}
#[doc = " Interface definition that stores methods used to communicate on the interface.\n\n The interface class is designed to allow custom user implementations. The type member stores\n a type identifier allowing the identification of the underlying type, including custom\n implementations. Standard interfaces provided by this library use types from 1 up to\n and including SBG_IF_TYPE_LAST_RESERVED. Greater values are intended to identify custom\n types that are normally specific to the project using this library. The value 0 identifies\n an unknown interface type, usually indicating that the interface was not correctly initialized."]
pub type SbgInterface = _SbgInterface;
#[doc = " Handle that stores the internal interface handle (ie Serial or Ethernet)"]
pub type SbgInterfaceHandle = *mut ::core::ffi::c_void;
#[doc = " Method to implement that close and destroy an interface.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the interface has been closed successfully."]
pub type SbgInterfaceDestroyFunc =
    ::core::option::Option<unsafe extern "C" fn(pInterface: *mut SbgInterface) -> SbgErrorCode>;
#[doc = " Method to implement to write a buffer to an interface.\n\n This method should return an error only if all bytes were not written successfully.\n If you try to write zero byte, the method shouldn't return any error.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\param[in]\tpBuffer\t\t\t\t\t\t\t\t\tPointer on an allocated buffer that contains the data to write\n \\param[in]\tbytesToWrite\t\t\t\t\t\t\tNumber of bytes we would like to write (can be zero).\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if exactly bytesToWrite have been written successfully."]
pub type SbgInterfaceWriteFunc = ::core::option::Option<
    unsafe extern "C" fn(
        pInterface: *mut SbgInterface,
        pBuffer: *const ::core::ffi::c_void,
        bytesToWrite: usize,
    ) -> SbgErrorCode,
>;
#[doc = " Method to implement to read data from an interface.\n\n This method returns an error only if there is a 'low level' error on the interface.\n If no byte is read at all or less bytes than bytesToRead, this method returns SBG_NO_ERROR.\n You have to check pReadBytes field to know the number of bytes actually read.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\param[in]\tpBuffer\t\t\t\t\t\t\t\t\tPointer on an allocated buffer that can hold at least bytesToRead bytes of data.\n \\param[out]\tpReadBytes\t\t\t\t\t\t\t\tReturns the number of bytes actually read (can be zero and up to bytesToRead).\n \\param[in]\tbytesToRead\t\t\t\t\t\t\t\tMaximum number of bytes to try to read on the interface.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if zero or some bytes have been read successfully."]
pub type SbgInterfaceReadFunc = ::core::option::Option<
    unsafe extern "C" fn(
        pInterface: *mut SbgInterface,
        pBuffer: *mut ::core::ffi::c_void,
        pReadBytes: *mut usize,
        bytesToRead: usize,
    ) -> SbgErrorCode,
>;
#[doc = " Make an interface flush pending input and/or output data.\n\n If flags include SBG_IF_FLUSH_INPUT, all pending input data is discarded.\n If flags include SBG_IF_FLUSH_OUTPUT, the function blocks until all output data has been written out.\n\n WARNING: The method has no action if not applicable for a type of interface\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\param[in]\tflags\t\t\t\t\t\t\t\t\tCombination of the SBG_IF_FLUSH_INPUT and SBG_IF_FLUSH_OUTPUT flags.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if successful."]
pub type SbgInterfaceFlushFunc = ::core::option::Option<
    unsafe extern "C" fn(pInterface: *mut SbgInterface, flags: u32) -> SbgErrorCode,
>;
#[doc = " Change an interface input and output speed in bps (bit per second)\n\n This method will try to change the speed immediately even if there are\n pending bytes in the send buffer.\n\n If you would like to make sure that all bytes in the Tx buffer have been\n sent before changing the speed, please flush the interface before.\n\n WARNING: The method has no action if not applicable for a type of interface\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\param[in]\tspeed\t\t\t\t\t\t\t\t\tThe new interface speed to set in bps.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if successful."]
pub type SbgInterfaceSetSpeed = ::core::option::Option<
    unsafe extern "C" fn(pInterface: *mut SbgInterface, speed: u32) -> SbgErrorCode,
>;
#[doc = " Returns the current interface baud rate in bps (bit per second)\n\n WARNING: The method will returns zero if not applicable for a type of interface\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tThe current interface baud rate in bps or zero if not applicable."]
pub type SbgInterfaceGetSpeed =
    ::core::option::Option<unsafe extern "C" fn(pInterface: *const SbgInterface) -> u32>;
#[doc = " Compute and return the delay needed by the interface to transmit / receive X number of bytes.\n\n WARNING: The method will returns zero if not applicable for a type of interface.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance.\n \\param[in]\tnumBytes\t\t\t\t\t\t\t\tThe number of bytes to transmit / receive to evaluate the needed delay.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tThe expected delay in us needed to transmit / receive the specified number of bytes or 0 if not applicable."]
pub type SbgInterfaceGetDelayFunc = ::core::option::Option<
    unsafe extern "C" fn(pInterface: *const SbgInterface, numBytes: usize) -> u32,
>;
#[doc = " Interface definition that stores methods used to communicate on the interface.\n\n The interface class is designed to allow custom user implementations. The type member stores\n a type identifier allowing the identification of the underlying type, including custom\n implementations. Standard interfaces provided by this library use types from 1 up to\n and including SBG_IF_TYPE_LAST_RESERVED. Greater values are intended to identify custom\n types that are normally specific to the project using this library. The value 0 identifies\n an unknown interface type, usually indicating that the interface was not correctly initialized."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgInterface {
    #[doc = "< Internal interface handle used to access the media."]
    pub handle: SbgInterfaceHandle,
    #[doc = "< Opaque interface type."]
    pub type_: u32,
    #[doc = "< The interface name as passed during the creation"]
    pub name: [::core::ffi::c_char; 48usize],
    #[doc = "< Optional method used to destroy an interface."]
    pub pDestroyFunc: SbgInterfaceDestroyFunc,
    #[doc = "< Optional method used to write some data to this interface."]
    pub pWriteFunc: SbgInterfaceWriteFunc,
    #[doc = "< Optional method used to read some data to this interface."]
    pub pReadFunc: SbgInterfaceReadFunc,
    #[doc = "< Optional method used to make this interface flush all pending data."]
    pub pFlushFunc: SbgInterfaceFlushFunc,
    #[doc = "< Optional method used to set the interface speed in bps."]
    pub pSetSpeedFunc: SbgInterfaceSetSpeed,
    #[doc = "< Optional method used to retrieve the interface speed in bps."]
    pub pGetSpeedFunc: SbgInterfaceGetSpeed,
    #[doc = "< Optional method used to compute an expected delay to transmit/receive X bytes"]
    pub pDelayFunc: SbgInterfaceGetDelayFunc,
}
#[test]
fn bindgen_test_layout__SbgInterface() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgInterface> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgInterface>(),
        84usize,
        concat!("Size of: ", stringify!(_SbgInterface))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgInterface>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgInterface))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pDestroyFunc) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pDestroyFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pWriteFunc) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pWriteFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pReadFunc) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pReadFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pFlushFunc) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pFlushFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pSetSpeedFunc) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pSetSpeedFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pGetSpeedFunc) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pGetSpeedFunc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pDelayFunc) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgInterface),
            "::",
            stringify!(pDelayFunc)
        )
    );
}
extern "C" {
    #[doc = " Initialize an interface instance to zero.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tThe interface instance."]
    pub fn sbgInterfaceZeroInit(pInterface: *mut SbgInterface);
}
extern "C" {
    #[doc = " Close and destroy the interface gracefully.\n\n This method will call the specialized interface destructor if any.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tThe interface instance.\n \\return\t\t\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the interface has been destroyed successfully."]
    pub fn sbgInterfaceDestroy(pInterface: *mut SbgInterface) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Returns the interface as string.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance\n \\return\t\t\t\t\t\t\t\t\t\t\t\tThe interface type."]
    pub fn sbgInterfaceTypeGetAsString(
        pInterface: *const SbgInterface,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    #[doc = " Define the interface name as a NULL terminated C string.\n\n This method make sure that the provided string will always fit within\n the allocated name buffer.\n\n If the interface name you would like to set is too long, only the end\n of the string will be kept.\n\n \\param[in]\tpInterface\t\t\t\t\t\t\t\tInterface instance\n \\param[in]\tpName\t\t\t\t\t\t\t\t\tThe interface name to set as a NULL terminated C string"]
    pub fn sbgInterfaceNameSet(pInterface: *mut SbgInterface, pName: *const ::core::ffi::c_char);
}
extern "C" {
    #[doc = "\tInitialize a serial interface for read and write operations.\n\n\t\\param[in]\tpInterface\t\t\t\t\t\tPointer on an allocated interface instance to initialize.\n\t\\param[in]\tdeviceName\t\t\t\t\t\tSerial interface location (COM21 , /dev/ttys0, depending on platform).\n\t\\param[in]\tbaudRate\t\t\t\t\t\tSerial interface baud rate in bps.\n\t\\return\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the interface has been created."]
    pub fn sbgInterfaceSerialCreate(
        pInterface: *mut SbgInterface,
        deviceName: *const ::core::ffi::c_char,
        baudRate: u32,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = "\tOpen a file as an interface for read only operations.\n\n\t\\param[in]\tpInterface\t\t\t\t\t\tPointer on an allocated interface instance to initialize.\n\t\\param[in]\tfilePath\t\t\t\t\t\tFile path to open.\n\t\\return\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the interface has been created."]
    pub fn sbgInterfaceFileOpen(
        pInterface: *mut SbgInterface,
        filePath: *const ::core::ffi::c_char,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = "\tOpen a file as an interface for write only operations.\n\n\t\\param[in]\tpInterface\t\t\t\t\t\tPointer on an allocated interface instance to initialize.\n\t\\param[in]\tfilePath\t\t\t\t\t\tFile path to open.\n\t\\return\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the interface has been created."]
    pub fn sbgInterfaceFileWriteOpen(
        pInterface: *mut SbgInterface,
        filePath: *const ::core::ffi::c_char,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = "\tReturns the file size in bytes.\n\n\t\\param[in]\tpInterface\t\t\t\t\t\tValid handle on an initialized interface.\n\t\\return\t\t\t\t\t\t\t\t\t\tThe file size in bytes."]
    pub fn sbgInterfaceFileGetSize(pInterface: *mut SbgInterface) -> usize;
}
extern "C" {
    #[doc = "\tReturns the current cursor position in the file in bytes.\n\n\t\\param[in]\tpInterface\t\t\t\t\t\tValid handle on an initialized interface.\n\t\\return\t\t\t\t\t\t\t\t\t\tThe current cursor position in bytes."]
    pub fn sbgInterfaceFileGetCursor(pInterface: *const SbgInterface) -> usize;
}
#[doc = " Defines the ECom transfer states"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgSplitBuffer {
    #[doc = "< Pointer on the buffer that needs to be split"]
    pub pLinkedBuffer: *mut u8,
    #[doc = "< Size of the original buffer"]
    pub linkedBufferSize: usize,
    #[doc = "< The size of the sub buffers"]
    pub subBufferSize: usize,
    #[doc = "< The number of sub buffers in this split buffer"]
    pub subBufferNbr: usize,
}
#[test]
fn bindgen_test_layout__SbgSplitBuffer() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgSplitBuffer> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgSplitBuffer>(),
        16usize,
        concat!("Size of: ", stringify!(_SbgSplitBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgSplitBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgSplitBuffer))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pLinkedBuffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgSplitBuffer),
            "::",
            stringify!(pLinkedBuffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).linkedBufferSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgSplitBuffer),
            "::",
            stringify!(linkedBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subBufferSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgSplitBuffer),
            "::",
            stringify!(subBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subBufferNbr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgSplitBuffer),
            "::",
            stringify!(subBufferNbr)
        )
    );
}
#[doc = " Defines the ECom transfer states"]
pub type SbgSplitBuffer = _SbgSplitBuffer;
#[doc = "< This stream buffer can perform read operations."]
pub const _SbgSBMode_SB_MODE_READ: _SbgSBMode = 0;
#[doc = "< This stream buffer can perform write operations."]
pub const _SbgSBMode_SB_MODE_WRITE: _SbgSBMode = 1;
#[doc = " Stream buffer modes."]
pub type _SbgSBMode = ::core::ffi::c_uint;
#[doc = " Stream buffer modes."]
pub use self::_SbgSBMode as SbgSBMode;
#[doc = "< The offset is referenced to the begining of the stream."]
pub const _SbgSBSeekOrigin_SB_SEEK_SET: _SbgSBSeekOrigin = 0;
#[doc = "< The offset is referenced to the current cursor position and increment the current cursor."]
pub const _SbgSBSeekOrigin_SB_SEEK_CUR_INC: _SbgSBSeekOrigin = 1;
#[doc = "< The offset is referenced to the current cursor position and decrement the current cursor."]
pub const _SbgSBSeekOrigin_SB_SEEK_CUR_DEC: _SbgSBSeekOrigin = 2;
#[doc = "< The offset is referenced to the end of the stream."]
pub const _SbgSBSeekOrigin_SB_SEEK_END: _SbgSBSeekOrigin = 3;
#[doc = " Enum used to define all seek modes"]
pub type _SbgSBSeekOrigin = ::core::ffi::c_uint;
#[doc = " Enum used to define all seek modes"]
pub use self::_SbgSBSeekOrigin as SbgSBSeekOrigin;
#[doc = " Defines a stream buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgStreamBuffer {
    #[doc = "< Defines the stream buffer modes (read/write)."]
    pub modes: SbgSBMode,
    #[doc = "< Size in bytes of the linked buffer."]
    pub bufferSize: usize,
    #[doc = "< Pointer to the buffer linked with this stream."]
    pub pBufferPtr: *mut u8,
    #[doc = "< Current pointer within the buffer."]
    pub pCurrentPtr: *mut u8,
    #[doc = "< Current error code on stream buffer."]
    pub errorCode: SbgErrorCode,
}
#[test]
fn bindgen_test_layout__SbgStreamBuffer() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgStreamBuffer> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgStreamBuffer>(),
        20usize,
        concat!("Size of: ", stringify!(_SbgStreamBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgStreamBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgStreamBuffer))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).modes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgStreamBuffer),
            "::",
            stringify!(modes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufferSize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgStreamBuffer),
            "::",
            stringify!(bufferSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pBufferPtr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgStreamBuffer),
            "::",
            stringify!(pBufferPtr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pCurrentPtr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgStreamBuffer),
            "::",
            stringify!(pCurrentPtr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errorCode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgStreamBuffer),
            "::",
            stringify!(errorCode)
        )
    );
}
#[doc = " Defines a stream buffer."]
pub type SbgStreamBuffer = _SbgStreamBuffer;
extern "C" {
    #[doc = " Convert an ip to a string of the form A.B.C.D\n \\param[in]\tipAddr\t\t\t\t\t\tIP address to convert to a string.\n \\param[out]\tpBuffer\t\t\t\t\t\tPointer on an allocated buffer than can hold ip address as a string.\n \\param[in]\tmaxSize\t\t\t\t\t\tMaximum number of chars that can be stored in pBuffer including the NULL char."]
    pub fn sbgNetworkIpToString(
        ipAddr: sbgIpAddress,
        pBuffer: *mut ::core::ffi::c_char,
        maxSize: usize,
    );
}
extern "C" {
    #[doc = " Convert an ip address stored in a string of the form A.B.C.D to an sbgIpAddress object.\n \\param[in]\tpBuffer\t\t\t\t\t\tIP address as a string of the form A.B.C.D\n \\return\t\t\t\t\t\t\t\t\tIP address parsed from the string or 0.0.0.0 if the IP is invalid."]
    pub fn sbgNetworkIpFromString(pBuffer: *const ::core::ffi::c_char) -> sbgIpAddress;
}
extern "C" {
    #[doc = " Check if an IpV4 netmask is valid, the mask should be contiguous (1111 followed by 0)\n \\param[in]\tnetmask\t\t\t\t\t\t\tThe netmask stored in an uint32_t (host endianness).\n \\return\t\t\t\t\t\t\t\t\t\ttrue if the netmask is valid ie contiguous."]
    pub fn sbgIpNetMaskValid(netmask: sbgIpAddress) -> bool;
}
pub const _SbgECanMessageId_SBG_ECAN_MSG_STATUS_01: _SbgECanMessageId = 256;
pub const _SbgECanMessageId_SBG_ECAN_MSG_STATUS_02: _SbgECanMessageId = 257;
pub const _SbgECanMessageId_SBG_ECAN_MSG_STATUS_03: _SbgECanMessageId = 258;
pub const _SbgECanMessageId_SBG_ECAN_MSG_UTC_0: _SbgECanMessageId = 272;
pub const _SbgECanMessageId_SBG_ECAN_MSG_UTC_1: _SbgECanMessageId = 273;
pub const _SbgECanMessageId_SBG_ECAN_MSG_IMU_INFO: _SbgECanMessageId = 288;
pub const _SbgECanMessageId_SBG_ECAN_MSG_IMU_ACCEL: _SbgECanMessageId = 289;
pub const _SbgECanMessageId_SBG_ECAN_MSG_IMU_GYRO: _SbgECanMessageId = 290;
pub const _SbgECanMessageId_SBG_ECAN_MSG_IMU_DELTA_VEL: _SbgECanMessageId = 291;
pub const _SbgECanMessageId_SBG_ECAN_MSG_IMU_DELTA_ANGLE: _SbgECanMessageId = 292;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_INFO: _SbgECanMessageId = 304;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_QUAT: _SbgECanMessageId = 305;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_EULER: _SbgECanMessageId = 306;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_ORIENTATION_ACC: _SbgECanMessageId = 307;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_POS: _SbgECanMessageId = 308;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_ALTITUDE: _SbgECanMessageId = 309;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_POS_ACC: _SbgECanMessageId = 310;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_VEL_NED: _SbgECanMessageId = 311;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_VEL_NED_ACC: _SbgECanMessageId = 312;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EKF_VEL_BODY: _SbgECanMessageId = 313;
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_INFO: _SbgECanMessageId = 320;
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_0: _SbgECanMessageId = 321;
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_1: _SbgECanMessageId = 325;
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_2: _SbgECanMessageId = 329;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_HP_INFO: _SbgECanMessageId = 330;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_HP_0: _SbgECanMessageId = 331;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_HP_1: _SbgECanMessageId = 332;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_SHIP_MOTION_HP_2: _SbgECanMessageId = 333;
pub const _SbgECanMessageId_SBG_ECAN_MSG_MAG_0: _SbgECanMessageId = 336;
pub const _SbgECanMessageId_SBG_ECAN_MSG_MAG_1: _SbgECanMessageId = 337;
pub const _SbgECanMessageId_SBG_ECAN_MSG_MAG_2: _SbgECanMessageId = 338;
pub const _SbgECanMessageId_SBG_ECAN_MSG_ODO_INFO: _SbgECanMessageId = 352;
pub const _SbgECanMessageId_SBG_ECAN_MSG_ODO_VEL: _SbgECanMessageId = 353;
pub const _SbgECanMessageId_SBG_ECAN_MSG_AIR_DATA_INFO: _SbgECanMessageId = 354;
pub const _SbgECanMessageId_SBG_ECAN_MSG_AIR_DATA_ALTITUDE: _SbgECanMessageId = 355;
pub const _SbgECanMessageId_SBG_ECAN_MSG_AIR_DATA_AIRSPEED: _SbgECanMessageId = 356;
pub const _SbgECanMessageId_SBG_ECAN_MSG_DEPTH_INFO: _SbgECanMessageId = 358;
pub const _SbgECanMessageId_SBG_ECAN_MSG_DEPTH_ALTITUDE: _SbgECanMessageId = 359;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_VEL_INFO: _SbgECanMessageId = 368;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_VEL: _SbgECanMessageId = 369;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_VEL_ACC: _SbgECanMessageId = 370;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_VEL_COURSE: _SbgECanMessageId = 371;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_POS_INFO: _SbgECanMessageId = 372;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_POS: _SbgECanMessageId = 373;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_POS_ALT: _SbgECanMessageId = 374;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_POS_ACC: _SbgECanMessageId = 375;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_HDT_INFO: _SbgECanMessageId = 376;
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS1_HDT: _SbgECanMessageId = 377;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_VEL_INFO: _SbgECanMessageId = 384;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_VEL: _SbgECanMessageId = 385;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_VEL_ACC: _SbgECanMessageId = 386;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_VEL_COURSE: _SbgECanMessageId = 387;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_POS_INFO: _SbgECanMessageId = 388;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_POS: _SbgECanMessageId = 389;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_POS_ALT: _SbgECanMessageId = 390;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_POS_ACC: _SbgECanMessageId = 391;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_HDT_INFO: _SbgECanMessageId = 392;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_GPS2_HDT: _SbgECanMessageId = 393;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_INFO_A: _SbgECanMessageId = 512;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_TIME_A: _SbgECanMessageId = 513;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_INFO_B: _SbgECanMessageId = 514;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_TIME_B: _SbgECanMessageId = 515;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_INFO_C: _SbgECanMessageId = 516;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_TIME_C: _SbgECanMessageId = 517;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_INFO_D: _SbgECanMessageId = 518;
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_TIME_D: _SbgECanMessageId = 519;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_INFO_E: _SbgECanMessageId = 520;
#[doc = "< Only for Ekinox, Apogee, Navsight & Quanta"]
pub const _SbgECanMessageId_SBG_ECAN_MSG_EVENT_TIME_E: _SbgECanMessageId = 521;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_DATINF: _SbgECanMessageId = 528;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_ACCS: _SbgECanMessageId = 529;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_OMGS: _SbgECanMessageId = 530;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_NRPY: _SbgECanMessageId = 531;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_VEL: _SbgECanMessageId = 532;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_TIME: _SbgECanMessageId = 533;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_GPS_INF: _SbgECanMessageId = 534;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_GPS_COG: _SbgECanMessageId = 535;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_ADDINF: _SbgECanMessageId = 536;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_POS1: _SbgECanMessageId = 537;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_POS2: _SbgECanMessageId = 538;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_SAT_INF: _SbgECanMessageId = 539;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_IACCS: _SbgECanMessageId = 540;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_IOMG: _SbgECanMessageId = 541;
pub const _SbgECanMessageId_SBG_ECAN_MSG_CASS_RR: _SbgECanMessageId = 542;
pub const _SbgECanMessageId_SBG_ECAN_MSG_AUTO_TRACK_SLIP_CURV: _SbgECanMessageId = 544;
#[doc = " Enum containing the list of messages that can be output on the can interface."]
pub type _SbgECanMessageId = ::core::ffi::c_uint;
#[doc = " Enum containing the list of messages that can be output on the can interface."]
pub use self::_SbgECanMessageId as SbgECanMessageId;
#[doc = "< Class that contains sbgECom protocol input/output log messages."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_ECOM_0: _SbgEComClass = 0;
#[doc = "< Class that contains special sbgECom output messages that handle high frequency output."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_ECOM_1: _SbgEComClass = 1;
#[doc = "< Class that contains NMEA (and NMEA like) output logs. <br>\nNote: This class is only used for identification purpose and does not contain any sbgECom message."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_NMEA_0: _SbgEComClass = 2;
#[doc = "< Class that contains proprietary NMEA (and NMEA like) output logs. <br>\nNote: This class is only used for identification purpose and does not contain any sbgECom message."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_NMEA_1: _SbgEComClass = 3;
#[doc = "< Class that contains third party output logs.\nNote: This class is only used for identification purpose and does not contain any sbgECom message."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_THIRD_PARTY_0: _SbgEComClass = 4;
#[doc = "< Class that contains sbgECom protocol commands."]
pub const _SbgEComClass_SBG_ECOM_CLASS_LOG_CMD_0: _SbgEComClass = 16;
#[doc = " Enum that defines all the message classes available.\n\n Keep in mind that message classes are encoded on 7 bits."]
pub type _SbgEComClass = ::core::ffi::c_uint;
#[doc = " Enum that defines all the message classes available.\n\n Keep in mind that message classes are encoded on 7 bits."]
pub use self::_SbgEComClass as SbgEComClass;
#[doc = "< Status general, clock, com aiding, solution, heave"]
pub const _SbgEComLog_SBG_ECOM_LOG_STATUS: _SbgEComLog = 1;
#[doc = "< Provides UTC time reference"]
pub const _SbgEComLog_SBG_ECOM_LOG_UTC_TIME: _SbgEComLog = 2;
#[doc = "< Includes IMU status, acc., gyro, temp delta speeds and delta angles values"]
pub const _SbgEComLog_SBG_ECOM_LOG_IMU_DATA: _SbgEComLog = 3;
#[doc = "< Magnetic data with associated accelerometer on each axis"]
pub const _SbgEComLog_SBG_ECOM_LOG_MAG: _SbgEComLog = 4;
#[doc = "< Magnetometer calibration data (raw buffer)"]
pub const _SbgEComLog_SBG_ECOM_LOG_MAG_CALIB: _SbgEComLog = 5;
#[doc = "< Includes roll, pitch, yaw and their accuracies on each axis"]
pub const _SbgEComLog_SBG_ECOM_LOG_EKF_EULER: _SbgEComLog = 6;
#[doc = "< Includes the 4 quaternions values"]
pub const _SbgEComLog_SBG_ECOM_LOG_EKF_QUAT: _SbgEComLog = 7;
#[doc = "< Position and velocities in NED coordinates with the accuracies on each axis"]
pub const _SbgEComLog_SBG_ECOM_LOG_EKF_NAV: _SbgEComLog = 8;
#[doc = "< Heave, surge and sway and accelerations on each axis."]
pub const _SbgEComLog_SBG_ECOM_LOG_SHIP_MOTION: _SbgEComLog = 9;
#[doc = "< GPS velocities from primary or secondary GPS receiver"]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS1_VEL: _SbgEComLog = 13;
#[doc = "< GPS positions from primary or secondary GPS receiver"]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS1_POS: _SbgEComLog = 14;
#[doc = "< GPS true heading from dual antenna system"]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS1_HDT: _SbgEComLog = 15;
#[doc = "< GPS 1 raw data for post processing."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS1_RAW: _SbgEComLog = 31;
#[doc = "< GPS 1 Satellite data."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS1_SAT: _SbgEComLog = 50;
#[doc = "< GPS 2 velocity log data."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS2_VEL: _SbgEComLog = 16;
#[doc = "< GPS 2 position log data."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS2_POS: _SbgEComLog = 17;
#[doc = "< GPS 2 true heading log data."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS2_HDT: _SbgEComLog = 18;
#[doc = "< GPS 2 raw data for post processing."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS2_RAW: _SbgEComLog = 38;
#[doc = "< GNSS2 Satellite data."]
pub const _SbgEComLog_SBG_ECOM_LOG_GPS2_SAT: _SbgEComLog = 51;
#[doc = "< Provides odometer velocity"]
pub const _SbgEComLog_SBG_ECOM_LOG_ODO_VEL: _SbgEComLog = 19;
#[doc = "< Event markers sent when events are detected on sync in A pin"]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_A: _SbgEComLog = 24;
#[doc = "< Event markers sent when events are detected on sync in B pin"]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_B: _SbgEComLog = 25;
#[doc = "< Event markers sent when events are detected on sync in C pin"]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_C: _SbgEComLog = 26;
#[doc = "< Event markers sent when events are detected on sync in D pin"]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_D: _SbgEComLog = 27;
#[doc = "< Event markers sent when events are detected on sync in E pin"]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_E: _SbgEComLog = 28;
#[doc = "< Doppler Velocity Log for bottom tracking data."]
pub const _SbgEComLog_SBG_ECOM_LOG_DVL_BOTTOM_TRACK: _SbgEComLog = 29;
#[doc = "< Doppler Velocity log for water layer data."]
pub const _SbgEComLog_SBG_ECOM_LOG_DVL_WATER_TRACK: _SbgEComLog = 30;
#[doc = "< Return delayed ship motion such as surge, sway, heave."]
pub const _SbgEComLog_SBG_ECOM_LOG_SHIP_MOTION_HP: _SbgEComLog = 32;
#[doc = "< Air Data aiding such as barometric altimeter and true air speed."]
pub const _SbgEComLog_SBG_ECOM_LOG_AIR_DATA: _SbgEComLog = 36;
#[doc = "< Raw USBL position data for subsea navigation."]
pub const _SbgEComLog_SBG_ECOM_LOG_USBL: _SbgEComLog = 37;
#[doc = "< Short IMU message recommended for post processing usages."]
pub const _SbgEComLog_SBG_ECOM_LOG_IMU_SHORT: _SbgEComLog = 44;
#[doc = "< Event marker used to time stamp each generated Sync Out A signal."]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_OUT_A: _SbgEComLog = 45;
#[doc = "< Event marker used to time stamp each generated Sync Out B signal."]
pub const _SbgEComLog_SBG_ECOM_LOG_EVENT_OUT_B: _SbgEComLog = 46;
#[doc = "< Depth sensor measurement log used for subsea navigation."]
pub const _SbgEComLog_SBG_ECOM_LOG_DEPTH: _SbgEComLog = 47;
#[doc = "< Diagnostic log."]
pub const _SbgEComLog_SBG_ECOM_LOG_DIAG: _SbgEComLog = 48;
#[doc = "< RTCM raw data."]
pub const _SbgEComLog_SBG_ECOM_LOG_RTCM_RAW: _SbgEComLog = 49;
#[doc = "< Helper definition to know the number of ECom messages"]
pub const _SbgEComLog_SBG_ECOM_LOG_ECOM_NUM_MESSAGES: _SbgEComLog = 50;
#[doc = " Enum that defines all the available ECom output logs from the sbgECom library."]
pub type _SbgEComLog = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available ECom output logs from the sbgECom library."]
pub use self::_SbgEComLog as SbgEComLog;
#[doc = "< Provides accelerometers, gyroscopes, time and status at 1KHz rate."]
pub const _SbgEComLog1MsgId_SBG_ECOM_LOG_FAST_IMU_DATA: _SbgEComLog1MsgId = 0;
#[doc = "< Helper definition to know the number of ECom messages"]
pub const _SbgEComLog1MsgId_SBG_ECOM_LOG_ECOM_1_NUM_MESSAGES: _SbgEComLog1MsgId = 1;
#[doc = " Enum that defines all the available ECom output logs in the class SBG_ECOM_CLASS_LOG_ECOM_1"]
pub type _SbgEComLog1MsgId = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available ECom output logs in the class SBG_ECOM_CLASS_LOG_ECOM_1"]
pub use self::_SbgEComLog1MsgId as SbgEComLog1;
#[doc = "< Latitude, Longitude, Altitude, Quality indicator."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_GGA: _SbgEComNmeaLog = 0;
#[doc = "< Latitude, Longitude, velocity, course over ground."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_RMC: _SbgEComNmeaLog = 1;
#[doc = "< UTC Time."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_ZDA: _SbgEComNmeaLog = 2;
#[doc = "< Heading (True)."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_HDT: _SbgEComNmeaLog = 3;
#[doc = "< GPS Pseudorange Noise Statistics."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_GST: _SbgEComNmeaLog = 4;
#[doc = "< Water referenced and ground referenced speed data."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_VBW: _SbgEComNmeaLog = 5;
#[doc = "< Depth sensor output."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_DPT: _SbgEComNmeaLog = 7;
#[doc = "< Track an Speed over the ground."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_VTG: _SbgEComNmeaLog = 8;
#[doc = "< Rate and direction of turn."]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_RTO: _SbgEComNmeaLog = 9;
#[doc = "< GNSS Satellites in View with azimuth, elevation and SNR information"]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_GSV: _SbgEComNmeaLog = 10;
#[doc = "< Helper definition to know the number of NMEA messages"]
pub const _SbgEComNmeaLog_SBG_ECOM_LOG_NMEA_NUM_MESSAGES: _SbgEComNmeaLog = 11;
#[doc = " Enum that defines all the available Nmea output logs from the sbgECom library."]
pub type _SbgEComNmeaLog = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available Nmea output logs from the sbgECom library."]
pub use self::_SbgEComNmeaLog as SbgEComNmeaLog;
#[doc = "< RDI proprietary sentence. Pitch, Roll, Heading"]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PRDID: _SbgEComIdNmea1Log = 0;
#[doc = "< SBG Systems proprietary sentence. Rotation rates, accelerations."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PSBGI: _SbgEComIdNmea1Log = 1;
#[doc = "< Proprietary sentence. Roll, Pitch, Heading, Heave."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PASHR: _SbgEComIdNmea1Log = 2;
#[doc = "< SBG Systems proprietary sentence. Attitude, heading, heave, angular rates, velocity."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PSBGB: _SbgEComIdNmea1Log = 3;
#[doc = "< Ixblue NMEA like log used to output Status information."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PHINF: _SbgEComIdNmea1Log = 5;
#[doc = "< Ixblue NMEA like log used to output Roll and Pitch."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PHTRO: _SbgEComIdNmea1Log = 6;
#[doc = "< Ixblue NMEA like log used to output Surge, Sway and Heave."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PHLIN: _SbgEComIdNmea1Log = 7;
#[doc = "< Ixblue NMEA like log used to output attitude and ship motion."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PHOCT: _SbgEComIdNmea1Log = 8;
#[doc = "< Ixblue NMEA like log used to output position, heading, attitude, attitude rate and speed."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_INDYN: _SbgEComIdNmea1Log = 9;
#[doc = "< Trimble NMEA like log with Time, Latitude, Longitude, Ellipsoidal height"]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_GGK: _SbgEComIdNmea1Log = 10;
#[doc = "< Trimble (Applanix) NMEA like log with UTC and PPS information."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PPS: _SbgEComIdNmea1Log = 11;
#[doc = "< WASSP NMEA like log similar to PASHR one."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_WASSP: _SbgEComIdNmea1Log = 12;
#[doc = "< SBG Systems proprietary sentence that reports EKF attitude and status."]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_PSBGA: _SbgEComIdNmea1Log = 13;
#[doc = "< Helper definition to know the number of NMEA messages"]
pub const _SbgEComIdNmea1Log_SBG_ECOM_LOG_NMEA_1_NUM_MESSAGES: _SbgEComIdNmea1Log = 14;
#[doc = " Enum that defines all the available Proprietary Nmea output logs from the sbgECom library."]
pub type _SbgEComIdNmea1Log = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available Proprietary Nmea output logs from the sbgECom library."]
pub use self::_SbgEComIdNmea1Log as SbgEComIdNmea1Log;
#[doc = "< Roll, Pitch, Heave, heave accelerations"]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_TSS1: _SbgEComIdThirdParty = 0;
#[doc = "< Roll, Pitch, Yaw"]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_KVH: _SbgEComIdThirdParty = 1;
#[doc = "< Teledyne PD0 DVL proprietary frame."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_PD0: _SbgEComIdThirdParty = 2;
#[doc = "< Konsberg SimRad 1000 proprietary frame that outputs Roll, Pitch and Heading."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_SIMRAD_1000: _SbgEComIdThirdParty = 3;
#[doc = "< Konsberg SimRad 3000 proprietary frame that outputs Roll, Pitch and Heading."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_SIMRAD_3000: _SbgEComIdThirdParty = 4;
#[doc = "< Konsberg Seapth Binary Log 26 used for MBES FM mode."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_SEAPATH_B26: _SbgEComIdThirdParty = 5;
#[doc = "< DOLOG Heading, Roll, Pitch proprietary and binary message."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_DOLOG_HRP: _SbgEComIdThirdParty = 6;
#[doc = "< Crossbow AHRS-500 Data Packet output with attitude, rate, acceleration and status."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_AHRS_500: _SbgEComIdThirdParty = 7;
#[doc = "< ADA specific Data Packet with IMU/INS/Status data"]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_ADA_01: _SbgEComIdThirdParty = 8;
#[doc = "< Cobham Aviator UAV 200 navigation (orientation & position) data"]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_AT_ITINS: _SbgEComIdThirdParty = 9;
#[doc = "< Kongsberg multibeam binary log."]
pub const _SbgEComIdThirdParty_SBG_ECOM_THIRD_PARTY_KONGSBERG_MB: _SbgEComIdThirdParty = 10;
#[doc = "< Helper definition to know the number of third party messages"]
pub const _SbgEComIdThirdParty_SBG_ECOM_LOG_THIRD_PARTY_NUM_MESSAGES: _SbgEComIdThirdParty = 11;
#[doc = " Enum that defines all the available Proprietary output logs from the sbgECom library."]
pub type _SbgEComIdThirdParty = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available Proprietary output logs from the sbgECom library."]
pub use self::_SbgEComIdThirdParty as SbgEComIdThirdParty;
#[doc = "< Acknowledge"]
pub const _SbgEComCmd_SBG_ECOM_CMD_ACK: _SbgEComCmd = 0;
#[doc = "< Performs various settings actions"]
pub const _SbgEComCmd_SBG_ECOM_CMD_SETTINGS_ACTION: _SbgEComCmd = 1;
#[doc = "< Imports a new settings structure to the sensor"]
pub const _SbgEComCmd_SBG_ECOM_CMD_IMPORT_SETTINGS: _SbgEComCmd = 2;
#[doc = "< Export the whole configuration from the sensor"]
pub const _SbgEComCmd_SBG_ECOM_CMD_EXPORT_SETTINGS: _SbgEComCmd = 3;
#[doc = "< Get basic device information"]
pub const _SbgEComCmd_SBG_ECOM_CMD_INFO: _SbgEComCmd = 4;
#[doc = "< Initial configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_INIT_PARAMETERS: _SbgEComCmd = 5;
#[doc = "< Set/get motion profile information"]
pub const _SbgEComCmd_SBG_ECOM_CMD_MOTION_PROFILE_ID: _SbgEComCmd = 7;
#[doc = "< Sensor alignment and lever arm on vehicle configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_IMU_ALIGNMENT_LEVER_ARM: _SbgEComCmd = 8;
#[doc = "< Aiding assignments such as RTCM / GPS / Odometer configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_AIDING_ASSIGNMENT: _SbgEComCmd = 9;
#[doc = "< Set/get magnetometer error model information"]
pub const _SbgEComCmd_SBG_ECOM_CMD_MAGNETOMETER_MODEL_ID: _SbgEComCmd = 11;
#[doc = "< Magnetometer aiding rejection mode"]
pub const _SbgEComCmd_SBG_ECOM_CMD_MAGNETOMETER_REJECT_MODE: _SbgEComCmd = 12;
#[doc = "< Set magnetic soft and hard Iron calibration data"]
pub const _SbgEComCmd_SBG_ECOM_CMD_SET_MAG_CALIB: _SbgEComCmd = 13;
#[doc = "< Start / reset internal magnetic field logging for calibration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_START_MAG_CALIB: _SbgEComCmd = 14;
#[doc = "< Compute a magnetic calibration based on previously logged data."]
pub const _SbgEComCmd_SBG_ECOM_CMD_COMPUTE_MAG_CALIB: _SbgEComCmd = 15;
#[doc = "< Set/get GNSS model information"]
pub const _SbgEComCmd_SBG_ECOM_CMD_GNSS_1_MODEL_ID: _SbgEComCmd = 17;
#[doc = "< DEPRECATED: GNSS installation configuration (lever arm, antenna alignments)"]
pub const _SbgEComCmd_SBG_ECOM_CMD_GNSS_1_LEVER_ARM_ALIGNMENT: _SbgEComCmd = 18;
#[doc = "< Define or retrieve the GNSS 1 main and secondary lever arms configuration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_GNSS_1_INSTALLATION: _SbgEComCmd = 46;
#[doc = "< GNSS aiding rejection modes configuration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_GNSS_1_REJECT_MODES: _SbgEComCmd = 19;
#[doc = "< Odometer gain, direction configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_ODO_CONF: _SbgEComCmd = 20;
#[doc = "< Odometer installation configuration (lever arm)"]
pub const _SbgEComCmd_SBG_ECOM_CMD_ODO_LEVER_ARM: _SbgEComCmd = 21;
#[doc = "< Odometer aiding rejection mode configuration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_ODO_REJECT_MODE: _SbgEComCmd = 22;
#[doc = "< UART interfaces configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_UART_CONF: _SbgEComCmd = 23;
#[doc = "< CAN bus interface configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_CAN_BUS_CONF: _SbgEComCmd = 24;
#[doc = "< CAN identifiers configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_CAN_OUTPUT_CONF: _SbgEComCmd = 25;
#[doc = "< Synchronization inputs configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_SYNC_IN_CONF: _SbgEComCmd = 26;
#[doc = "< Synchronization outputs configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_SYNC_OUT_CONF: _SbgEComCmd = 27;
#[doc = "< NMEA talker ID configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_NMEA_TALKER_ID: _SbgEComCmd = 29;
#[doc = "< Output configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_OUTPUT_CONF: _SbgEComCmd = 30;
#[doc = "< Advanced settings configuration"]
pub const _SbgEComCmd_SBG_ECOM_CMD_ADVANCED_CONF: _SbgEComCmd = 32;
#[doc = "< Retrieve device features"]
pub const _SbgEComCmd_SBG_ECOM_CMD_FEATURES: _SbgEComCmd = 33;
#[doc = "< Upload and apply a new license"]
pub const _SbgEComCmd_SBG_ECOM_CMD_LICENSE_APPLY: _SbgEComCmd = 34;
#[doc = "< Enable/disable the output of an entire class"]
pub const _SbgEComCmd_SBG_ECOM_CMD_OUTPUT_CLASS_ENABLE: _SbgEComCmd = 35;
#[doc = "< Set/get Ethernet configuration such as DHCP mode and IP address."]
pub const _SbgEComCmd_SBG_ECOM_CMD_ETHERNET_CONF: _SbgEComCmd = 36;
#[doc = "< Return the current IP used by the device."]
pub const _SbgEComCmd_SBG_ECOM_CMD_ETHERNET_INFO: _SbgEComCmd = 37;
#[doc = "< Set/get Validity flag thresholds for position, velocity, attitude and heading"]
pub const _SbgEComCmd_SBG_ECOM_CMD_VALIDITY_THRESHOLDS: _SbgEComCmd = 38;
#[doc = "< Set/get DVL model id to use"]
pub const _SbgEComCmd_SBG_ECOM_CMD_DVL_MODEL_ID: _SbgEComCmd = 39;
#[doc = "< DVL installation configuration (lever arm, alignments)"]
pub const _SbgEComCmd_SBG_ECOM_CMD_DVL_INSTALLATION: _SbgEComCmd = 40;
#[doc = "< DVL aiding rejection modes configuration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_DVL_REJECT_MODES: _SbgEComCmd = 41;
#[doc = "< Set/get AirData model id and protocol to use."]
pub const _SbgEComCmd_SBG_ECOM_CMD_AIRDATA_MODEL_ID: _SbgEComCmd = 42;
#[doc = "< AirData installation configuration (lever arm, offsets)"]
pub const _SbgEComCmd_SBG_ECOM_CMD_AIRDATA_LEVER_ARM: _SbgEComCmd = 43;
#[doc = "< AirData aiding rejection modes configuration."]
pub const _SbgEComCmd_SBG_ECOM_CMD_AIRDATA_REJECT_MODES: _SbgEComCmd = 44;
#[doc = "< Configuration for CAN based odometer (CAN ID & DBC)"]
pub const _SbgEComCmd_SBG_ECOM_CMD_ODO_CAN_CONF: _SbgEComCmd = 45;
#[doc = "< Command equivalent to the HTTP GET method for a REST API."]
pub const _SbgEComCmd_SBG_ECOM_CMD_API_GET: _SbgEComCmd = 46;
#[doc = "< Command equivalent to the HTTP POST method for a REST API."]
pub const _SbgEComCmd_SBG_ECOM_CMD_API_POST: _SbgEComCmd = 47;
#[doc = "< Helper definition to know the number of commands"]
pub const _SbgEComCmd_SBG_ECOM_LOG_ECOM_NUM_CMDS: _SbgEComCmd = 48;
#[doc = " Enum that defines all the available commands for the sbgECom library."]
pub type _SbgEComCmd = ::core::ffi::c_uint;
#[doc = " Enum that defines all the available commands for the sbgECom library."]
pub use self::_SbgEComCmd as SbgEComCmd;
#[doc = "\tThis type defines any message identifier.\n\tBecause message identifiers enum will be different with each class id, we use a generic uint8_t rather than an enum."]
pub type SbgEComMsgId = u8;
#[doc = " Payload.\n\n This class is used to abstract whether some payload is received from a single\n or multiple frames."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgEComProtocolPayload {
    #[doc = "< True if the buffer is allocated with malloc()."]
    pub allocated: bool,
    #[doc = "< Buffer."]
    pub pBuffer: *mut ::core::ffi::c_void,
    #[doc = "< Buffer size, in bytes."]
    pub size: usize,
}
#[test]
fn bindgen_test_layout__SbgEComProtocolPayload() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgEComProtocolPayload> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgEComProtocolPayload>(),
        12usize,
        concat!("Size of: ", stringify!(_SbgEComProtocolPayload))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgEComProtocolPayload>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgEComProtocolPayload))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).allocated) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocolPayload),
            "::",
            stringify!(allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pBuffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocolPayload),
            "::",
            stringify!(pBuffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocolPayload),
            "::",
            stringify!(size)
        )
    );
}
#[doc = " Payload.\n\n This class is used to abstract whether some payload is received from a single\n or multiple frames."]
pub type SbgEComProtocolPayload = _SbgEComProtocolPayload;
#[doc = " Struct containing all protocol related data.\n\n The member variables related to large transfers are valid if and only if the large buffer is valid."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgEComProtocol {
    #[doc = "< Associated interface used by the protocol to read/write bytes."]
    pub pLinkedInterface: *mut SbgInterface,
    #[doc = "< The reception buffer."]
    pub rxBuffer: [u8; 4096usize],
    #[doc = "< The current reception buffer size in bytes."]
    pub rxBufferSize: usize,
    #[doc = "< Number of bytes to discard on the next receive attempt."]
    pub discardSize: usize,
    #[doc = "< Transfer ID of the next large send."]
    pub nextLargeTxId: u8,
    #[doc = "< Buffer for large transfers, allocated with malloc() if valid."]
    pub pLargeBuffer: *mut u8,
    #[doc = "< Size of the large transfer buffer, in bytes."]
    pub largeBufferSize: usize,
    #[doc = "< Message class for the current large transfer."]
    pub msgClass: u8,
    #[doc = "< Message ID for the current large transfer."]
    pub msgId: u8,
    #[doc = "< ID of the current large transfer."]
    pub transferId: u8,
    #[doc = "< Expected page index of the next frame."]
    pub pageIndex: u16,
    #[doc = "< Number of pages in the current transfer."]
    pub nrPages: u16,
}
#[test]
fn bindgen_test_layout__SbgEComProtocol() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgEComProtocol> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgEComProtocol>(),
        4128usize,
        concat!("Size of: ", stringify!(_SbgEComProtocol))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgEComProtocol>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgEComProtocol))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pLinkedInterface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(pLinkedInterface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxBuffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(rxBuffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rxBufferSize) as usize - ptr as usize },
        4100usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(rxBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).discardSize) as usize - ptr as usize },
        4104usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(discardSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nextLargeTxId) as usize - ptr as usize },
        4108usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(nextLargeTxId)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pLargeBuffer) as usize - ptr as usize },
        4112usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(pLargeBuffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).largeBufferSize) as usize - ptr as usize },
        4116usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(largeBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msgClass) as usize - ptr as usize },
        4120usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(msgClass)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msgId) as usize - ptr as usize },
        4121usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(msgId)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).transferId) as usize - ptr as usize },
        4122usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(transferId)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pageIndex) as usize - ptr as usize },
        4124usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(pageIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nrPages) as usize - ptr as usize },
        4126usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgEComProtocol),
            "::",
            stringify!(nrPages)
        )
    );
}
#[doc = " Struct containing all protocol related data.\n\n The member variables related to large transfers are valid if and only if the large buffer is valid."]
pub type SbgEComProtocol = _SbgEComProtocol;
extern "C" {
    #[doc = " Payload constructor.\n\n \\param[in]\tpPayload\t\t\t\tPayload."]
    pub fn sbgEComProtocolPayloadConstruct(pPayload: *mut SbgEComProtocolPayload);
}
extern "C" {
    #[doc = " Payload destructor.\n\n \\param[in]\tpPayload\t\t\t\tPayload."]
    pub fn sbgEComProtocolPayloadDestroy(pPayload: *mut SbgEComProtocolPayload);
}
extern "C" {
    #[doc = " Get the buffer of a payload.\n\n \\param[in]\tpPayload\t\t\t\tPayload.\n \\return\t\t\t\t\t\t\t\tPayload buffer."]
    pub fn sbgEComProtocolPayloadGetBuffer(
        pPayload: *const SbgEComProtocolPayload,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Get the size of a payload buffer.\n\n \\param[in]\tpPayload\t\t\t\tPayload.\n \\return\t\t\t\t\t\t\t\tSize of the payload buffer, in bytes."]
    pub fn sbgEComProtocolPayloadGetSize(pPayload: *const SbgEComProtocolPayload) -> usize;
}
extern "C" {
    #[doc = " Move the buffer of a payload.\n\n If successful, the ownership of the buffer is passed to the caller. Otherwise, the payload\n is unchanged.\n\n The buffer must be released with free() once unused.\n\n \\param[in]\tpPayload\t\t\t\tPayload.\n \\return\t\t\t\t\t\t\t\tPayload buffer if successful, NULL otherwise."]
    pub fn sbgEComProtocolPayloadMoveBuffer(
        pPayload: *mut SbgEComProtocolPayload,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Initialize the protocol system used to communicate with the product and return the created handle.\n\n \\param[in]\tpProtocol\t\t\t\tPointer on an allocated protocol structure to initialize.\n \\param[in]\tpInterface\t\t\t\tInterface to use for read/write operations.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR if we have initialised the protocol system."]
    pub fn sbgEComProtocolInit(
        pProtocol: *mut SbgEComProtocol,
        pInterface: *mut SbgInterface,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Close the protocol system.\n\n \\param[in]\tpProtocol\t\t\t\tA valid protocol handle to close.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR if we have closed and released the protocol system."]
    pub fn sbgEComProtocolClose(pProtocol: *mut SbgEComProtocol) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Purge the interface rx buffer as well as the sbgECom rx work buffer.\n\n For example, if the program flow has been interrupted, this method can be helpful to discard all trash received data.\n\n WARNING: This method is blocking for 100ms and actively tries to read incoming data.\n\n \\param[in]\tpProtocol\t\t\t\t\t\tA valid SbgEComProtocol handle.\n \\return\t\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the incoming data has been purged successfully."]
    pub fn sbgEComProtocolPurgeIncoming(pProtocol: *mut SbgEComProtocol) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Send data.\n\n If the size is SBG_ECOM_MAX_PAYLOAD_SIZE or less, the data is sent in a single frame. Otherwise,\n is it fragmented into multiple extended frames, each sent in order, which may block.\n\n \\param[in]\tpProtocol\t\t\t\tA valid protocol handle.\n \\param[in]\tmsgClass\t\t\t\tMessage class.\n \\param[in]\tmsg\t\t\t\t\t\tMessage ID.\n \\param[in]\tpData\t\t\t\t\tData buffer.\n \\param[in]\tsize\t\t\t\t\tData buffer size, in bytes.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR if the frame has been sent."]
    pub fn sbgEComProtocolSend(
        pProtocol: *mut SbgEComProtocol,
        msgClass: u8,
        msg: u8,
        pData: *const ::core::ffi::c_void,
        size: usize,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Receive a frame.\n\n \\param[in]\tpProtocol\t\t\t\tA valid protocol handle.\n \\param[out]\tpMsgClass\t\t\t\tMessage class, may be NULL.\n \\param[out]\tpMsgId\t\t\t\t\tMessage ID, may be NULL.\n \\param[out]\tpData\t\t\t\t\tData buffer.\n \\param[out]\tpSize\t\t\t\t\tNumber of bytes received.\n \\param[in]\tmaxSize\t\t\t\t\tData buffer size, in bytes.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR if successful,\n\t\t\t\t\t\t\t\t\t\tSBG_NOT_READY if no complete frame has been received,\n\t\t\t\t\t\t\t\t\t\tSBG_BUFFER_OVERFLOW if the payload of the received frame couldn't fit into the data buffer."]
    pub fn sbgEComProtocolReceive(
        pProtocol: *mut SbgEComProtocol,
        pMsgClass: *mut u8,
        pMsgId: *mut u8,
        pData: *mut ::core::ffi::c_void,
        pSize: *mut usize,
        maxSize: usize,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Receive a frame.\n\n This function is equivalent to sbgEComProtocolReceive() with two exceptions :\n  - the use of a payload object allows handling payloads not limited by the size of a user-provided buffer\n  - the payload object allows direct access to the protocol work buffer to avoid an extra copy per call\n\n Any allocated resource associated with the given payload is released when calling this function.\n\n Because the payload buffer may directly refer to the protocol work buffer on return, it is only valid until\n the next attempt to receive a frame, with any of the receive functions.\n\n \\param[in]\tpProtocol\t\t\t\tA valid protocol handle.\n \\param[out]\tpMsgClass\t\t\t\tMessage class, may be NULL.\n \\param[out]\tpMsgId\t\t\t\t\tMessage ID, may be NULL.\n \\param[out]\tpPayload\t\t\t\tPayload.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR if successful,\n\t\t\t\t\t\t\t\t\t\tSBG_NOT_READY if no complete frame has been received."]
    pub fn sbgEComProtocolReceive2(
        pProtocol: *mut SbgEComProtocol,
        pMsgClass: *mut u8,
        pMsgId: *mut u8,
        pPayload: *mut SbgEComProtocolPayload,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Initialize an output stream for an sbgECom frame generation.\n\n This function is helpful to avoid memory copy compared to sbgEComProtocolSend one.\n\n Only standard frames may be sent with this function.\n\n \\param[in]\tpOutputStream\t\t\tPointer to an allocated and initialized output stream.\n \\param[in]\tmsgClass\t\t\t\tMessage class.\n \\param[in]\tmsg\t\t\t\t\t\tMessage ID.\n \\param[out]\tpStreamCursor\t\t\tThe initial output stream cursor that thus points to the begining of the generated message.\n\t\t\t\t\t\t\t\t\t\tThis value should be passed to sbgEComFinalizeFrameGeneration for correct operations.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR in case of good operation."]
    pub fn sbgEComStartFrameGeneration(
        pOutputStream: *mut SbgStreamBuffer,
        msgClass: u8,
        msg: u8,
        pStreamCursor: *mut usize,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Finalize an output stream that has been initialized with sbgEComStartFrameGeneration.\n\n At return, the output stream buffer should point at the end of the generated message.\n You can thus easily create consecutive SBG_ECOM_LOGS with these methods.\n\n \\param[in]\tpOutputStream\t\t\tPointer to an allocated and initialized output stream.\n \\param[in]\tstreamCursor\t\t\tPosition in the stream buffer of the generated message first byte.\n\t\t\t\t\t\t\t\t\t\tThis value is returned by sbgEComStartFrameGeneration and is mandatory for correct operations.\n \\return\t\t\t\t\t\t\t\tSBG_NO_ERROR in case of good operation."]
    pub fn sbgEComFinalizeFrameGeneration(
        pOutputStream: *mut SbgStreamBuffer,
        streamCursor: usize,
    ) -> SbgErrorCode;
}
#[doc = " Log structure for AirData."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogAirData {
    #[doc = "< Time in us since the sensor power up OR measurement delay in us."]
    pub timeStamp: u32,
    #[doc = "< Airdata sensor status bitmask."]
    pub status: u16,
    #[doc = "< Raw absolute pressure measured by the barometer sensor in Pascals."]
    pub pressureAbs: f32,
    #[doc = "< Altitude computed from barometric altimeter in meters and positive upward."]
    pub altitude: f32,
    #[doc = "< Raw differential pressure measured by the pitot tube in Pascal."]
    pub pressureDiff: f32,
    #[doc = "< True airspeed measured by a pitot tube in m.s^-1 and positive forward."]
    pub trueAirspeed: f32,
    #[doc = "< Outside air temperature in C that could be used to compute true airspeed from differential pressure."]
    pub airTemperature: f32,
}
#[test]
fn bindgen_test_layout__SbgLogAirData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogAirData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogAirData>(),
        28usize,
        concat!("Size of: ", stringify!(_SbgLogAirData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogAirData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogAirData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pressureAbs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(pressureAbs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).altitude) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(altitude)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pressureDiff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(pressureDiff)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trueAirspeed) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(trueAirspeed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).airTemperature) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogAirData),
            "::",
            stringify!(airTemperature)
        )
    );
}
#[doc = " Log structure for AirData."]
pub type SbgLogAirData = _SbgLogAirData;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_AIR_DATA message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseAirData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogAirData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_AIR_DATA message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteAirData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogAirData,
    ) -> SbgErrorCode;
}
#[doc = " Log structure for Depth sensor measurement (subsea)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogDepth {
    #[doc = "< Time in us since the sensor power up OR measurement delay in us."]
    pub timeStamp: u32,
    #[doc = "< Airdata sensor status bitmask."]
    pub status: u16,
    #[doc = "< Raw absolute pressure measured by the depth sensor in Pascals."]
    pub pressureAbs: f32,
    #[doc = "< Altitude computed from depth sensor in meters and positive upward."]
    pub altitude: f32,
}
#[test]
fn bindgen_test_layout__SbgLogDepth() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogDepth> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogDepth>(),
        16usize,
        concat!("Size of: ", stringify!(_SbgLogDepth))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogDepth>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogDepth))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDepth),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDepth),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pressureAbs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDepth),
            "::",
            stringify!(pressureAbs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).altitude) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDepth),
            "::",
            stringify!(altitude)
        )
    );
}
#[doc = " Log structure for Depth sensor measurement (subsea)."]
pub type SbgLogDepth = _SbgLogDepth;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_DEPTH message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseDepth(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogDepth,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_DEPTH message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteDepth(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogDepth,
    ) -> SbgErrorCode;
}
#[doc = " Diagnostic log structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogDiagData {
    #[doc = "< Timestamp, in microseconds."]
    pub timestamp: u32,
    #[doc = "< Log type."]
    pub type_: SbgDebugLogType,
    #[doc = "< Error code."]
    pub errorCode: SbgErrorCode,
    #[doc = "< Log string, null-terminated."]
    pub string: [::core::ffi::c_char; 4080usize],
}
#[test]
fn bindgen_test_layout__SbgLogDiagData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogDiagData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogDiagData>(),
        4092usize,
        concat!("Size of: ", stringify!(_SbgLogDiagData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogDiagData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogDiagData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDiagData),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDiagData),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errorCode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDiagData),
            "::",
            stringify!(errorCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDiagData),
            "::",
            stringify!(string)
        )
    );
}
#[doc = " Diagnostic log structure."]
pub type SbgLogDiagData = _SbgLogDiagData;
extern "C" {
    #[doc = "\tParse data for SBG_ECOM_LOG_DIAG messages and fill the corresponding structure.\n\n\t\\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n\t\\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n\t\\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseDiagData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogDiagData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for SBG_ECOM_LOG_DIAG messages to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteDiagData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogDiagData,
    ) -> SbgErrorCode;
}
#[doc = " Log structure for DVL data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogDvlData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< DVL status bitmask."]
    pub status: u16,
    #[doc = "< X, Y, Z velocities in m.s^-1 expressed in the DVL instrument frame."]
    pub velocity: [f32; 3usize],
    #[doc = "< X, Y, Z velocities quality indicators as provided by the DVL sensor and expressed in m.s^-1.\nWARNING: This is typically just a residual information and not a real standard deviation."]
    pub velocityQuality: [f32; 3usize],
}
#[test]
fn bindgen_test_layout__SbgLogDvlData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogDvlData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogDvlData>(),
        32usize,
        concat!("Size of: ", stringify!(_SbgLogDvlData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogDvlData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogDvlData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDvlData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDvlData),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDvlData),
            "::",
            stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocityQuality) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogDvlData),
            "::",
            stringify!(velocityQuality)
        )
    );
}
#[doc = " Log structure for DVL data."]
pub type SbgLogDvlData = _SbgLogDvlData;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_DVL_BOTTOM_TRACK / SBG_ECOM_LOG_DVL_WATER_TRACK message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseDvlData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogDvlData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_DVL_BOTTOM_TRACK / SBG_ECOM_LOG_DVL_WATER_TRACK message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteDvlData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogDvlData,
    ) -> SbgErrorCode;
}
#[doc = "< The Kalman filter is not initialized and the returned data are all invalid."]
pub const _SbgEComSolutionMode_SBG_ECOM_SOL_MODE_UNINITIALIZED: _SbgEComSolutionMode = 0;
#[doc = "< The Kalman filter only rely on a vertical reference to compute roll and pitch angles. Heading and navigation data drift freely."]
pub const _SbgEComSolutionMode_SBG_ECOM_SOL_MODE_VERTICAL_GYRO: _SbgEComSolutionMode = 1;
#[doc = "< A heading reference is available, the Kalman filter provides full orientation but navigation data drift freely."]
pub const _SbgEComSolutionMode_SBG_ECOM_SOL_MODE_AHRS: _SbgEComSolutionMode = 2;
#[doc = "< The Kalman filter computes orientation and velocity. Position is freely integrated from velocity estimation."]
pub const _SbgEComSolutionMode_SBG_ECOM_SOL_MODE_NAV_VELOCITY: _SbgEComSolutionMode = 3;
#[doc = "< Nominal mode, the Kalman filter computes all parameters (attitude, velocity, position). Absolute position is provided."]
pub const _SbgEComSolutionMode_SBG_ECOM_SOL_MODE_NAV_POSITION: _SbgEComSolutionMode = 4;
#[doc = " Solution filter mode enum."]
pub type _SbgEComSolutionMode = ::core::ffi::c_uint;
#[doc = " Solution filter mode enum."]
pub use self::_SbgEComSolutionMode as SbgEComSolutionMode;
#[doc = " EKF computed orientation using euler angles."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogEkfEulerData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< Roll, Pitch and Yaw angles in rad."]
    pub euler: [f32; 3usize],
    #[doc = "< Roll, Pitch and Yaw angles 1 sigma standard deviation in rad."]
    pub eulerStdDev: [f32; 3usize],
    #[doc = "< EKF solution status bitmask and enum."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout__SbgLogEkfEulerData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogEkfEulerData> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogEkfEulerData>(),
        32usize,
        concat!("Size of: ", stringify!(_SbgLogEkfEulerData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogEkfEulerData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogEkfEulerData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfEulerData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).euler) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfEulerData),
            "::",
            stringify!(euler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eulerStdDev) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfEulerData),
            "::",
            stringify!(eulerStdDev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfEulerData),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " EKF computed orientation using euler angles."]
pub type SbgLogEkfEulerData = _SbgLogEkfEulerData;
#[doc = " EFK computed orientation using quaternion."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogEkfQuatData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< Orientation quaternion stored in W, X, Y, Z form."]
    pub quaternion: [f32; 4usize],
    #[doc = "< Roll, Pitch and Yaw angles 1 sigma standard deviation in rad."]
    pub eulerStdDev: [f32; 3usize],
    #[doc = "< EKF solution status bitmask and enum."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout__SbgLogEkfQuatData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogEkfQuatData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogEkfQuatData>(),
        36usize,
        concat!("Size of: ", stringify!(_SbgLogEkfQuatData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogEkfQuatData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogEkfQuatData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfQuatData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quaternion) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfQuatData),
            "::",
            stringify!(quaternion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eulerStdDev) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfQuatData),
            "::",
            stringify!(eulerStdDev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfQuatData),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " EFK computed orientation using quaternion."]
pub type SbgLogEkfQuatData = _SbgLogEkfQuatData;
#[doc = " EFK computed navigation data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogEkfNavData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< North, East, Down velocity in m.s^-1."]
    pub velocity: [f32; 3usize],
    #[doc = "< North, East, Down velocity 1 sigma standard deviation in m.s^-1."]
    pub velocityStdDev: [f32; 3usize],
    #[doc = "< Latitude, Longitude in degrees positive North and East.\nAltitude above Mean Sea Level in meters."]
    pub position: [f64; 3usize],
    #[doc = "< Altitude difference between the geoid and the Ellipsoid in meters (Height above Ellipsoid = altitude + undulation)."]
    pub undulation: f32,
    #[doc = "< Latitude, longitude and altitude 1 sigma standard deviation in meters."]
    pub positionStdDev: [f32; 3usize],
    #[doc = "< EKF solution status bitmask and enum."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout__SbgLogEkfNavData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogEkfNavData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogEkfNavData>(),
        80usize,
        concat!("Size of: ", stringify!(_SbgLogEkfNavData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogEkfNavData>(),
        8usize,
        concat!("Alignment of ", stringify!(_SbgLogEkfNavData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocityStdDev) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(velocityStdDev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).undulation) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(undulation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).positionStdDev) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(positionStdDev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEkfNavData),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " EFK computed navigation data."]
pub type SbgLogEkfNavData = _SbgLogEkfNavData;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_EKF_EULER message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseEkfEulerData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogEkfEulerData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_EKF_EULER message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteEkfEulerData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogEkfEulerData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_EKF_QUAT message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseEkfQuatData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogEkfQuatData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_EKF_QUAT message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteEkfQuatData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogEkfQuatData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_EKF_NAV message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseEkfNavData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogEkfNavData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_EKF_NAV message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteEkfNavData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogEkfNavData,
    ) -> SbgErrorCode;
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_EVENT_# message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogEvent {
    #[doc = "< Measurement time since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< Events status bitmask."]
    pub status: u16,
    #[doc = "< Time offset for the second received event."]
    pub timeOffset0: u16,
    #[doc = "< Time offset for the third received event."]
    pub timeOffset1: u16,
    #[doc = "< Time offset for the fourth received event."]
    pub timeOffset2: u16,
    #[doc = "< Time offset for the fifth received event."]
    pub timeOffset3: u16,
}
#[test]
fn bindgen_test_layout__SbgLogEvent() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogEvent> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogEvent>(),
        16usize,
        concat!("Size of: ", stringify!(_SbgLogEvent))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogEvent))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOffset0) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(timeOffset0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOffset1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(timeOffset1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOffset2) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(timeOffset2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOffset3) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogEvent),
            "::",
            stringify!(timeOffset3)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_EVENT_# message."]
pub type SbgLogEvent = _SbgLogEvent;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_EVENT_# message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseEvent(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogEvent,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_EVENT_# message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteEvent(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogEvent,
    ) -> SbgErrorCode;
}
#[doc = " Structure that stores raw data message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogRawData {
    #[doc = "< Buffer that contains raw data."]
    pub rawBuffer: [u8; 4086usize],
    #[doc = "< Raw buffer size in bytes."]
    pub bufferSize: usize,
}
#[test]
fn bindgen_test_layout__SbgLogRawData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogRawData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogRawData>(),
        4092usize,
        concat!("Size of: ", stringify!(_SbgLogRawData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogRawData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogRawData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rawBuffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogRawData),
            "::",
            stringify!(rawBuffer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bufferSize) as usize - ptr as usize },
        4088usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogRawData),
            "::",
            stringify!(bufferSize)
        )
    );
}
#[doc = " Structure that stores raw data message."]
pub type SbgLogRawData = _SbgLogRawData;
extern "C" {
    #[doc = " Parse raw data message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseRawData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogRawData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write raw data message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteRawData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogRawData,
    ) -> SbgErrorCode;
}
#[doc = "< A valid solution has been computed."]
pub const _SbgEComGpsVelStatus_SBG_ECOM_VEL_SOL_COMPUTED: _SbgEComGpsVelStatus = 0;
#[doc = "< Not enough valid SV to compute a solution."]
pub const _SbgEComGpsVelStatus_SBG_ECOM_VEL_INSUFFICIENT_OBS: _SbgEComGpsVelStatus = 1;
#[doc = "< An internal error has occurred."]
pub const _SbgEComGpsVelStatus_SBG_ECOM_VEL_INTERNAL_ERROR: _SbgEComGpsVelStatus = 2;
#[doc = "< Velocity limit exceeded."]
pub const _SbgEComGpsVelStatus_SBG_ECOM_VEL_LIMIT: _SbgEComGpsVelStatus = 3;
#[doc = " GPS velocity status definitions."]
pub type _SbgEComGpsVelStatus = ::core::ffi::c_uint;
#[doc = " GPS velocity status definitions."]
pub use self::_SbgEComGpsVelStatus as SbgEComGpsVelStatus;
#[doc = "< No valid velocity solution available."]
pub const _SbgEComGpsVelType_SBG_ECOM_VEL_NO_SOLUTION: _SbgEComGpsVelType = 0;
#[doc = "< An unknown solution type has been computed."]
pub const _SbgEComGpsVelType_SBG_ECOM_VEL_UNKNOWN_TYPE: _SbgEComGpsVelType = 1;
#[doc = "< A Doppler velocity has been computed."]
pub const _SbgEComGpsVelType_SBG_ECOM_VEL_DOPPLER: _SbgEComGpsVelType = 2;
#[doc = "< A differential velocity has been computed between two positions."]
pub const _SbgEComGpsVelType_SBG_ECOM_VEL_DIFFERENTIAL: _SbgEComGpsVelType = 3;
#[doc = " GPS velocity types definitions."]
pub type _SbgEComGpsVelType = ::core::ffi::c_uint;
#[doc = " GPS velocity types definitions."]
pub use self::_SbgEComGpsVelType as SbgEComGpsVelType;
#[doc = "< A valid solution has been computed."]
pub const _SbgEComGpsPosStatus_SBG_ECOM_POS_SOL_COMPUTED: _SbgEComGpsPosStatus = 0;
#[doc = "< Not enough valid SV to compute a solution."]
pub const _SbgEComGpsPosStatus_SBG_ECOM_POS_INSUFFICIENT_OBS: _SbgEComGpsPosStatus = 1;
#[doc = "< An internal error has occurred."]
pub const _SbgEComGpsPosStatus_SBG_ECOM_POS_INTERNAL_ERROR: _SbgEComGpsPosStatus = 2;
#[doc = "< The height limit has been exceeded."]
pub const _SbgEComGpsPosStatus_SBG_ECOM_POS_HEIGHT_LIMIT: _SbgEComGpsPosStatus = 3;
#[doc = " GPS position status definitions."]
pub type _SbgEComGpsPosStatus = ::core::ffi::c_uint;
#[doc = " GPS position status definitions."]
pub use self::_SbgEComGpsPosStatus as SbgEComGpsPosStatus;
#[doc = "< No valid solution available."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_NO_SOLUTION: _SbgEComGpsPosType = 0;
#[doc = "< An unknown solution type has been computed."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_UNKNOWN_TYPE: _SbgEComGpsPosType = 1;
#[doc = "< Single point solution position."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_SINGLE: _SbgEComGpsPosType = 2;
#[doc = "< Standard Pseudorange Differential Solution (DGPS)."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_PSRDIFF: _SbgEComGpsPosType = 3;
#[doc = "< SBAS satellite used for differential corrections."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_SBAS: _SbgEComGpsPosType = 4;
#[doc = "< Omnistar VBS Position (L1 sub-meter)."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_OMNISTAR: _SbgEComGpsPosType = 5;
#[doc = "< Floating RTK ambiguity solution (20 cms RTK)."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_RTK_FLOAT: _SbgEComGpsPosType = 6;
#[doc = "< Integer RTK ambiguity solution (2 cms RTK)."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_RTK_INT: _SbgEComGpsPosType = 7;
#[doc = "< Precise Point Positioning with float ambiguities."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_PPP_FLOAT: _SbgEComGpsPosType = 8;
#[doc = "< Precise Point Positioning with fixed ambiguities."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_PPP_INT: _SbgEComGpsPosType = 9;
#[doc = "< Fixed location solution position."]
pub const _SbgEComGpsPosType_SBG_ECOM_POS_FIXED: _SbgEComGpsPosType = 10;
#[doc = " GPS position types definitions."]
pub type _SbgEComGpsPosType = ::core::ffi::c_uint;
#[doc = " GPS position types definitions."]
pub use self::_SbgEComGpsPosType as SbgEComGpsPosType;
#[doc = "< A valid solution has been computed."]
pub const _SbgEComGpsHdtStatus_SBG_ECOM_HDT_SOL_COMPUTED: _SbgEComGpsHdtStatus = 0;
#[doc = "< Not enough valid SV to compute a solution."]
pub const _SbgEComGpsHdtStatus_SBG_ECOM_HDT_INSUFFICIENT_OBS: _SbgEComGpsHdtStatus = 1;
#[doc = "< An internal error has occurred."]
pub const _SbgEComGpsHdtStatus_SBG_ECOM_HDT_INTERNAL_ERROR: _SbgEComGpsHdtStatus = 2;
#[doc = "< The height limit has been exceeded."]
pub const _SbgEComGpsHdtStatus_SBG_ECOM_HDT_HEIGHT_LIMIT: _SbgEComGpsHdtStatus = 3;
#[doc = " GPS HDT status definitions."]
pub type _SbgEComGpsHdtStatus = ::core::ffi::c_uint;
#[doc = " GPS HDT status definitions."]
pub use self::_SbgEComGpsHdtStatus as SbgEComGpsHdtStatus;
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_VEL message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogGpsVel {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< GPS velocity status, type and bitmask."]
    pub status: u32,
    #[doc = "< GPS time of week in ms."]
    pub timeOfWeek: u32,
    #[doc = "< GPS North, East, Down velocity in m.s^-1."]
    pub velocity: [f32; 3usize],
    #[doc = "< GPS North, East, Down velocity 1 sigma accuracy in m.s^-1."]
    pub velocityAcc: [f32; 3usize],
    #[doc = "< Track ground course in degrees."]
    pub course: f32,
    #[doc = "< Course accuracy in degrees."]
    pub courseAcc: f32,
}
#[test]
fn bindgen_test_layout__SbgLogGpsVel() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogGpsVel> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogGpsVel>(),
        44usize,
        concat!("Size of: ", stringify!(_SbgLogGpsVel))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogGpsVel>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogGpsVel))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOfWeek) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(timeOfWeek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocity) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(velocity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).velocityAcc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(velocityAcc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).course) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(course)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).courseAcc) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsVel),
            "::",
            stringify!(courseAcc)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_VEL message."]
pub type SbgLogGpsVel = _SbgLogGpsVel;
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_POS message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogGpsPos {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< GPS position status, type and bitmask."]
    pub status: u32,
    #[doc = "< GPS time of week in ms."]
    pub timeOfWeek: u32,
    #[doc = "< Latitude in degrees, positive north."]
    pub latitude: f64,
    #[doc = "< Longitude in degrees, positive east."]
    pub longitude: f64,
    #[doc = "< Altitude above Mean Sea Level in meters."]
    pub altitude: f64,
    #[doc = "< Altitude difference between the geoid and the Ellipsoid in meters (Height above Ellipsoid = altitude + undulation)."]
    pub undulation: f32,
    #[doc = "< 1 sigma latitude accuracy in meters."]
    pub latitudeAccuracy: f32,
    #[doc = "< 1 sigma longitude accuracy in meters."]
    pub longitudeAccuracy: f32,
    #[doc = "< 1 sigma altitude accuracy in meters."]
    pub altitudeAccuracy: f32,
    #[doc = "< Number of space vehicles used to compute the solution (since version 1.4)."]
    pub numSvUsed: u8,
    #[doc = "< Base station id for differential corrections (0-4095). Set to 0xFFFF if differential corrections are not used (since version 1.4)."]
    pub baseStationId: u16,
    #[doc = "< Differential correction age in 0.01 seconds. Set to 0XFFFF if differential corrections are not used (since version 1.4)."]
    pub differentialAge: u16,
}
#[test]
fn bindgen_test_layout__SbgLogGpsPos() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogGpsPos> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogGpsPos>(),
        64usize,
        concat!("Size of: ", stringify!(_SbgLogGpsPos))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogGpsPos>(),
        8usize,
        concat!("Alignment of ", stringify!(_SbgLogGpsPos))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOfWeek) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(timeOfWeek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).latitude) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(latitude)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).longitude) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(longitude)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).altitude) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(altitude)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).undulation) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(undulation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).latitudeAccuracy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(latitudeAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).longitudeAccuracy) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(longitudeAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).altitudeAccuracy) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(altitudeAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numSvUsed) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(numSvUsed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).baseStationId) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(baseStationId)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).differentialAge) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsPos),
            "::",
            stringify!(differentialAge)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_POS message."]
pub type SbgLogGpsPos = _SbgLogGpsPos;
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_HDT message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogGpsHdt {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< GPS HDT status, type and bitmask."]
    pub status: u16,
    #[doc = "< GPS time of week in ms."]
    pub timeOfWeek: u32,
    #[doc = "< GPS true heading in degrees."]
    pub heading: f32,
    #[doc = "< 1 sigma GPS true heading accuracy in degrees."]
    pub headingAccuracy: f32,
    #[doc = "< GPS pitch angle measured from the master to the rover in degrees."]
    pub pitch: f32,
    #[doc = "< 1 signa GPS pitch angle accuarcy in degrees."]
    pub pitchAccuracy: f32,
    #[doc = "< The distance between the main and aux antenna in meters."]
    pub baseline: f32,
}
#[test]
fn bindgen_test_layout__SbgLogGpsHdt() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogGpsHdt> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogGpsHdt>(),
        32usize,
        concat!("Size of: ", stringify!(_SbgLogGpsHdt))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogGpsHdt>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogGpsHdt))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeOfWeek) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(timeOfWeek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).heading) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(heading)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).headingAccuracy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(headingAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pitch) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pitchAccuracy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(pitchAccuracy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).baseline) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogGpsHdt),
            "::",
            stringify!(baseline)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_GPS#_HDT message."]
pub type SbgLogGpsHdt = _SbgLogGpsHdt;
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_GPS#_VEL message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseGpsVelData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogGpsVel,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_GPS#_VEL message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteGpsVelData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogGpsVel,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_GPS#_POS message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseGpsPosData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogGpsPos,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_GPS#_POS message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteGpsPosData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogGpsPos,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_GPS#_HDT message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseGpsHdtData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogGpsHdt,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_GPS#_HDT message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteGpsHdtData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogGpsHdt,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_GPS#_RAW message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseGpsRawData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogRawData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_GPS#_RAW message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteGpsRawData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogRawData,
    ) -> SbgErrorCode;
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_IMU_DATA message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogImuData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< IMU status bitmask."]
    pub status: u16,
    #[doc = "< X, Y, Z accelerometers in m.s^-2."]
    pub accelerometers: [f32; 3usize],
    #[doc = "< X, Y, Z gyroscopes in rad.s^-1."]
    pub gyroscopes: [f32; 3usize],
    #[doc = "< Internal temperature in C."]
    pub temperature: f32,
    #[doc = "< X, Y, Z delta velocity in m.s^-2."]
    pub deltaVelocity: [f32; 3usize],
    #[doc = "< X, Y, Z delta angle in rad.s^-1."]
    pub deltaAngle: [f32; 3usize],
}
#[test]
fn bindgen_test_layout__SbgLogImuData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogImuData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogImuData>(),
        60usize,
        concat!("Size of: ", stringify!(_SbgLogImuData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogImuData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogImuData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).accelerometers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(accelerometers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gyroscopes) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(gyroscopes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temperature) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(temperature)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deltaVelocity) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(deltaVelocity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deltaAngle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuData),
            "::",
            stringify!(deltaAngle)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_IMU_DATA message."]
pub type SbgLogImuData = _SbgLogImuData;
#[doc = " Structure that stores data for the SBG_ECOM_LOG_IMU_SHORT message.\n This message is only sent asynchronously and is the preferred log for post processing."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogImuShort {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< IMU status bitmask."]
    pub status: u16,
    #[doc = "< X, Y, Z delta velocity. Unit is 1048576 LSB for 1 m.s^-2."]
    pub deltaVelocity: [i32; 3usize],
    #[doc = "< X, Y, Z delta angle. Unit is 67108864 LSB for 1 rad.s^-1."]
    pub deltaAngle: [i32; 3usize],
    #[doc = "< IMU average temperature. Unit is 256 LSB for 1C."]
    pub temperature: i16,
}
#[test]
fn bindgen_test_layout__SbgLogImuShort() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogImuShort> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogImuShort>(),
        36usize,
        concat!("Size of: ", stringify!(_SbgLogImuShort))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogImuShort>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogImuShort))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuShort),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuShort),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deltaVelocity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuShort),
            "::",
            stringify!(deltaVelocity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deltaAngle) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuShort),
            "::",
            stringify!(deltaAngle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temperature) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogImuShort),
            "::",
            stringify!(temperature)
        )
    );
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_IMU_SHORT message.\n This message is only sent asynchronously and is the preferred log for post processing."]
pub type SbgLogImuShort = _SbgLogImuShort;
#[doc = " Structure that stores the data for SBG_ECOM_LOG_FAST_IMU_DATA message"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogFastImuData {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< IMU status bitmask."]
    pub status: u16,
    #[doc = "< X, Y, Z accelerometers in m.s^-2."]
    pub accelerometers: [f32; 3usize],
    #[doc = "< X, Y, Z gyroscopes in rad.s^-1."]
    pub gyroscopes: [f32; 3usize],
}
#[test]
fn bindgen_test_layout__SbgLogFastImuData() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogFastImuData> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogFastImuData>(),
        32usize,
        concat!("Size of: ", stringify!(_SbgLogFastImuData))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogFastImuData>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogFastImuData))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogFastImuData),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogFastImuData),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).accelerometers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogFastImuData),
            "::",
            stringify!(accelerometers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gyroscopes) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogFastImuData),
            "::",
            stringify!(gyroscopes)
        )
    );
}
#[doc = " Structure that stores the data for SBG_ECOM_LOG_FAST_IMU_DATA message"]
pub type SbgLogFastImuData = _SbgLogFastImuData;
extern "C" {
    #[doc = " Return from an IMU Short log, the X, Y or Z delta angle value in rad.s^-1\n\n \\param[in]\tpImuShort\t\t\t\t\tInput IMU short message instance.\n \\param[in]\tidx\t\t\t\t\t\t\tThe component to return from 0 to 2.\n \\return\t\t\t\t\t\t\t\t\tThe delta angle value converted in rad.s^-1."]
    pub fn sbgLogImuShortGetDeltaAngle(pImuShort: *const SbgLogImuShort, idx: usize) -> f32;
}
extern "C" {
    #[doc = " Return from an IMU Short log, the X, Y or Z delta velocity value in m.s^-2\n\n \\param[in]\tpImuShort\t\t\t\t\tInput IMU short message instance.\n \\param[in]\tidx\t\t\t\t\t\t\tThe component to return from 0 to 2.\n \\return\t\t\t\t\t\t\t\t\tThe delta velocity value converted in m.s^-2."]
    pub fn sbgLogImuShortGetDeltaVelocity(pImuShort: *const SbgLogImuShort, idx: usize) -> f32;
}
extern "C" {
    #[doc = " Return from an IMU Short log, the temperature in C\n\n \\param[in]\tpImuShort\t\t\t\t\tInput IMU short message instance.\n \\return\t\t\t\t\t\t\t\t\tThe converted temperature in C"]
    pub fn sbgLogImuShortGetTemperature(pImuShort: *const SbgLogImuShort) -> f32;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_IMU_DATA message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseImuData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogImuData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_IMU_DATA message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteImuData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogImuData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_IMU_SHORT message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseImuShort(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogImuShort,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_IMU_SHORT message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteImuShort(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogImuShort,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Parse data for the SBG_ECOM_LOG_FAST_IMU_DATA message and fill the corresponding structure.\n\n \\param[in]\tpInputStream\t\t\t\tInput stream buffer to read the payload from.\n \\param[out]\tpOutputData\t\t\t\t\tPointer on the output structure that stores parsed data.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the payload has been parsed."]
    pub fn sbgEComBinaryLogParseFastImuData(
        pInputStream: *mut SbgStreamBuffer,
        pOutputData: *mut SbgLogFastImuData,
    ) -> SbgErrorCode;
}
extern "C" {
    #[doc = " Write data for the SBG_ECOM_LOG_FAST_IMU_DATA message to the output stream buffer from the provided structure.\n\n \\param[out]\tpOutputStream\t\t\t\tOutput stream buffer to write the payload to.\n \\param[in]\tpInputData\t\t\t\t\tPointer on the input structure that stores data to write.\n \\return\t\t\t\t\t\t\t\t\tSBG_NO_ERROR if the message has been generated in the provided buffer."]
    pub fn sbgEComBinaryLogWriteFastImuData(
        pOutputStream: *mut SbgStreamBuffer,
        pInputData: *const SbgLogFastImuData,
    ) -> SbgErrorCode;
}
#[doc = " Structure that stores data for the SBG_ECOM_LOG_MAG message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SbgLogMag {
    #[doc = "< Time in us since the sensor power up."]
    pub timeStamp: u32,
    #[doc = "< Magnetometer status bitmask."]
    pub status: u16,
    #[doc = "< X, Y, Z magnetometer data in A.U."]
    pub magnetometers: [f32; 3usize],
    #[doc = "< X, Y, Z accelerometers in m.s^-2."]
    pub accelerometers: [f32; 3usize],
}
#[test]
fn bindgen_test_layout__SbgLogMag() {
    const UNINIT: ::core::mem::MaybeUninit<_SbgLogMag> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SbgLogMag>(),
        32usize,
        concat!("Size of: ", stringify!(_SbgLogMag))
    );
    assert_eq!(
        ::core::mem::align_of::<_SbgLogMag>(),
        4usize,
        concat!("Alignment of ", stringify!(_SbgLogMag))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogMag),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogMag),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).magnetometers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SbgLogMag),
            "::",
            stringify!(magnetometers)
        )
    );
    assert_eq!(
